Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x539 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 18 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x3958d): GNU C11 13.3.1 20240614 -mcpu=cortex-m0 -mfloat-abi=soft -mthumb -march=armv6s-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x71d82): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x1a017): C:/Users/andre/Desktop/E2A S2/Progeto_di_semestre/3_Design/FW/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 3 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x4072a): signed char
 <1><31>: Abbrev Number: 3 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 1
    <33>   DW_AT_encoding    : 8	(unsigned char)
    <34>   DW_AT_name        : (indirect string, offset: 0x5c9c8): unsigned char
 <1><38>: Abbrev Number: 3 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 2
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x5f2bc): short int
 <1><3f>: Abbrev Number: 4 (DW_TAG_typedef)
    <40>   DW_AT_name        : (indirect string, offset: 0x689d4): __uint16_t
    <44>   DW_AT_decl_file   : 3
    <45>   DW_AT_decl_line   : 57
    <46>   DW_AT_decl_column : 25
    <47>   DW_AT_type        : <0x4b>
 <1><4b>: Abbrev Number: 3 (DW_TAG_base_type)
    <4c>   DW_AT_byte_size   : 2
    <4d>   DW_AT_encoding    : 7	(unsigned)
    <4e>   DW_AT_name        : (indirect string, offset: 0x7a239): short unsigned int
 <1><52>: Abbrev Number: 3 (DW_TAG_base_type)
    <53>   DW_AT_byte_size   : 4
    <54>   DW_AT_encoding    : 5	(signed)
    <55>   DW_AT_name        : (indirect string, offset: 0xb0b0): long int
 <1><59>: Abbrev Number: 4 (DW_TAG_typedef)
    <5a>   DW_AT_name        : (indirect string, offset: 0x5166f): __uint32_t
    <5e>   DW_AT_decl_file   : 3
    <5f>   DW_AT_decl_line   : 79
    <60>   DW_AT_decl_column : 25
    <61>   DW_AT_type        : <0x65>
 <1><65>: Abbrev Number: 3 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 7	(unsigned)
    <68>   DW_AT_name        : (indirect string, offset: 0x440c0): long unsigned int
 <1><6c>: Abbrev Number: 3 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (indirect string, offset: 0x3ad4b): long long int
 <1><73>: Abbrev Number: 3 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 8
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x1a7f2): long long unsigned int
 <1><7a>: Abbrev Number: 19 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : int
 <1><81>: Abbrev Number: 3 (DW_TAG_base_type)
    <82>   DW_AT_byte_size   : 4
    <83>   DW_AT_encoding    : 7	(unsigned)
    <84>   DW_AT_name        : (indirect string, offset: 0xaaa9): unsigned int
 <1><88>: Abbrev Number: 4 (DW_TAG_typedef)
    <89>   DW_AT_name        : (indirect string, offset: 0x689d6): uint16_t
    <8d>   DW_AT_decl_file   : 4
    <8e>   DW_AT_decl_line   : 36
    <8f>   DW_AT_decl_column : 20
    <90>   DW_AT_type        : <0x3f>
 <1><94>: Abbrev Number: 4 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x51671): uint32_t
    <99>   DW_AT_decl_file   : 4
    <9a>   DW_AT_decl_line   : 48
    <9b>   DW_AT_decl_column : 20
    <9c>   DW_AT_type        : <0x59>
 <1><a0>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 20 (DW_TAG_array_type)
    <a6>   DW_AT_type        : <0xa0>
    <aa>   DW_AT_sibling     : <0xb5>
 <2><ae>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <af>   DW_AT_type        : <0x81>
    <b3>   DW_AT_upper_bound : 1
 <2><b4>: Abbrev Number: 0
 <1><b5>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <b6>   DW_AT_type        : <0xa5>
 <1><ba>: Abbrev Number: 14 (DW_TAG_structure_type)
    <bb>   DW_AT_byte_size   : 44
    <bc>   DW_AT_decl_file   : 5
    <bc>   DW_AT_decl_line   : 320
    <be>   DW_AT_decl_column : 9
    <be>   DW_AT_sibling     : <0x147>
 <2><c2>: Abbrev Number: 2 (DW_TAG_member)
    <c3>   DW_AT_name        : (indirect string, offset: 0xc91): MODER
    <c7>   DW_AT_decl_file   : 5
    <c8>   DW_AT_decl_line   : 322
    <ca>   DW_AT_decl_column : 17
    <cb>   DW_AT_type        : <0xa0>
    <cf>   DW_AT_data_member_location: 0
 <2><d0>: Abbrev Number: 2 (DW_TAG_member)
    <d1>   DW_AT_name        : (indirect string, offset: 0x631eb): OTYPER
    <d5>   DW_AT_decl_file   : 5
    <d6>   DW_AT_decl_line   : 323
    <d8>   DW_AT_decl_column : 17
    <d9>   DW_AT_type        : <0xa0>
    <dd>   DW_AT_data_member_location: 4
 <2><de>: Abbrev Number: 2 (DW_TAG_member)
    <df>   DW_AT_name        : (indirect string, offset: 0x6f711): OSPEEDR
    <e3>   DW_AT_decl_file   : 5
    <e4>   DW_AT_decl_line   : 324
    <e6>   DW_AT_decl_column : 17
    <e7>   DW_AT_type        : <0xa0>
    <eb>   DW_AT_data_member_location: 8
 <2><ec>: Abbrev Number: 2 (DW_TAG_member)
    <ed>   DW_AT_name        : (indirect string, offset: 0x52b33): PUPDR
    <f1>   DW_AT_decl_file   : 5
    <f2>   DW_AT_decl_line   : 325
    <f4>   DW_AT_decl_column : 17
    <f5>   DW_AT_type        : <0xa0>
    <f9>   DW_AT_data_member_location: 12
 <2><fa>: Abbrev Number: 6 (DW_TAG_member)
    <fb>   DW_AT_name        : IDR
    <ff>   DW_AT_decl_file   : 5
    <ff>   DW_AT_decl_line   : 326
    <101>   DW_AT_decl_column : 17
    <101>   DW_AT_type        : <0xa0>
    <105>   DW_AT_data_member_location: 16
 <2><106>: Abbrev Number: 6 (DW_TAG_member)
    <107>   DW_AT_name        : ODR
    <10b>   DW_AT_decl_file   : 5
    <10b>   DW_AT_decl_line   : 327
    <10d>   DW_AT_decl_column : 17
    <10d>   DW_AT_type        : <0xa0>
    <111>   DW_AT_data_member_location: 20
 <2><112>: Abbrev Number: 2 (DW_TAG_member)
    <113>   DW_AT_name        : (indirect string, offset: 0x1c968): BSRR
    <117>   DW_AT_decl_file   : 5
    <118>   DW_AT_decl_line   : 328
    <11a>   DW_AT_decl_column : 17
    <11b>   DW_AT_type        : <0xa0>
    <11f>   DW_AT_data_member_location: 24
 <2><120>: Abbrev Number: 2 (DW_TAG_member)
    <121>   DW_AT_name        : (indirect string, offset: 0x6dfa0): LCKR
    <125>   DW_AT_decl_file   : 5
    <126>   DW_AT_decl_line   : 329
    <128>   DW_AT_decl_column : 17
    <129>   DW_AT_type        : <0xa0>
    <12d>   DW_AT_data_member_location: 28
 <2><12e>: Abbrev Number: 6 (DW_TAG_member)
    <12f>   DW_AT_name        : AFR
    <133>   DW_AT_decl_file   : 5
    <133>   DW_AT_decl_line   : 330
    <135>   DW_AT_decl_column : 17
    <135>   DW_AT_type        : <0xb5>
    <139>   DW_AT_data_member_location: 32
 <2><13a>: Abbrev Number: 6 (DW_TAG_member)
    <13b>   DW_AT_name        : BRR
    <13f>   DW_AT_decl_file   : 5
    <13f>   DW_AT_decl_line   : 331
    <141>   DW_AT_decl_column : 17
    <141>   DW_AT_type        : <0xa0>
    <145>   DW_AT_data_member_location: 40
 <2><146>: Abbrev Number: 0
 <1><147>: Abbrev Number: 11 (DW_TAG_typedef)
    <148>   DW_AT_name        : (indirect string, offset: 0x7bbad): GPIO_TypeDef
    <14c>   DW_AT_decl_file   : 5
    <14d>   DW_AT_decl_line   : 332
    <14f>   DW_AT_decl_column : 3
    <14f>   DW_AT_type        : <0xba>
 <1><153>: Abbrev Number: 14 (DW_TAG_structure_type)
    <154>   DW_AT_byte_size   : 56
    <155>   DW_AT_decl_file   : 5
    <155>   DW_AT_decl_line   : 392
    <157>   DW_AT_decl_column : 9
    <157>   DW_AT_sibling     : <0x217>
 <2><15b>: Abbrev Number: 6 (DW_TAG_member)
    <15c>   DW_AT_name        : CR
    <15f>   DW_AT_decl_file   : 5
    <15f>   DW_AT_decl_line   : 394
    <161>   DW_AT_decl_column : 17
    <161>   DW_AT_type        : <0xa0>
    <165>   DW_AT_data_member_location: 0
 <2><166>: Abbrev Number: 2 (DW_TAG_member)
    <167>   DW_AT_name        : (indirect string, offset: 0x4d467): CFGR
    <16b>   DW_AT_decl_file   : 5
    <16c>   DW_AT_decl_line   : 395
    <16e>   DW_AT_decl_column : 17
    <16f>   DW_AT_type        : <0xa0>
    <173>   DW_AT_data_member_location: 4
 <2><174>: Abbrev Number: 6 (DW_TAG_member)
    <175>   DW_AT_name        : CIR
    <179>   DW_AT_decl_file   : 5
    <179>   DW_AT_decl_line   : 396
    <17b>   DW_AT_decl_column : 17
    <17b>   DW_AT_type        : <0xa0>
    <17f>   DW_AT_data_member_location: 8
 <2><180>: Abbrev Number: 2 (DW_TAG_member)
    <181>   DW_AT_name        : (indirect string, offset: 0x37e96): APB2RSTR
    <185>   DW_AT_decl_file   : 5
    <186>   DW_AT_decl_line   : 397
    <188>   DW_AT_decl_column : 17
    <189>   DW_AT_type        : <0xa0>
    <18d>   DW_AT_data_member_location: 12
 <2><18e>: Abbrev Number: 2 (DW_TAG_member)
    <18f>   DW_AT_name        : (indirect string, offset: 0xe84d): APB1RSTR
    <193>   DW_AT_decl_file   : 5
    <194>   DW_AT_decl_line   : 398
    <196>   DW_AT_decl_column : 17
    <197>   DW_AT_type        : <0xa0>
    <19b>   DW_AT_data_member_location: 16
 <2><19c>: Abbrev Number: 2 (DW_TAG_member)
    <19d>   DW_AT_name        : (indirect string, offset: 0xbeae): AHBENR
    <1a1>   DW_AT_decl_file   : 5
    <1a2>   DW_AT_decl_line   : 399
    <1a4>   DW_AT_decl_column : 17
    <1a5>   DW_AT_type        : <0xa0>
    <1a9>   DW_AT_data_member_location: 20
 <2><1aa>: Abbrev Number: 2 (DW_TAG_member)
    <1ab>   DW_AT_name        : (indirect string, offset: 0xf1b6): APB2ENR
    <1af>   DW_AT_decl_file   : 5
    <1b0>   DW_AT_decl_line   : 400
    <1b2>   DW_AT_decl_column : 17
    <1b3>   DW_AT_type        : <0xa0>
    <1b7>   DW_AT_data_member_location: 24
 <2><1b8>: Abbrev Number: 2 (DW_TAG_member)
    <1b9>   DW_AT_name        : (indirect string, offset: 0x604b9): APB1ENR
    <1bd>   DW_AT_decl_file   : 5
    <1be>   DW_AT_decl_line   : 401
    <1c0>   DW_AT_decl_column : 17
    <1c1>   DW_AT_type        : <0xa0>
    <1c5>   DW_AT_data_member_location: 28
 <2><1c6>: Abbrev Number: 2 (DW_TAG_member)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x11b42): BDCR
    <1cb>   DW_AT_decl_file   : 5
    <1cc>   DW_AT_decl_line   : 402
    <1ce>   DW_AT_decl_column : 17
    <1cf>   DW_AT_type        : <0xa0>
    <1d3>   DW_AT_data_member_location: 32
 <2><1d4>: Abbrev Number: 6 (DW_TAG_member)
    <1d5>   DW_AT_name        : CSR
    <1d9>   DW_AT_decl_file   : 5
    <1d9>   DW_AT_decl_line   : 403
    <1db>   DW_AT_decl_column : 17
    <1db>   DW_AT_type        : <0xa0>
    <1df>   DW_AT_data_member_location: 36
 <2><1e0>: Abbrev Number: 2 (DW_TAG_member)
    <1e1>   DW_AT_name        : (indirect string, offset: 0xa995): AHBRSTR
    <1e5>   DW_AT_decl_file   : 5
    <1e6>   DW_AT_decl_line   : 404
    <1e8>   DW_AT_decl_column : 17
    <1e9>   DW_AT_type        : <0xa0>
    <1ed>   DW_AT_data_member_location: 40
 <2><1ee>: Abbrev Number: 2 (DW_TAG_member)
    <1ef>   DW_AT_name        : (indirect string, offset: 0x4b011): CFGR2
    <1f3>   DW_AT_decl_file   : 5
    <1f4>   DW_AT_decl_line   : 405
    <1f6>   DW_AT_decl_column : 17
    <1f7>   DW_AT_type        : <0xa0>
    <1fb>   DW_AT_data_member_location: 44
 <2><1fc>: Abbrev Number: 2 (DW_TAG_member)
    <1fd>   DW_AT_name        : (indirect string, offset: 0x4b017): CFGR3
    <201>   DW_AT_decl_file   : 5
    <202>   DW_AT_decl_line   : 406
    <204>   DW_AT_decl_column : 17
    <205>   DW_AT_type        : <0xa0>
    <209>   DW_AT_data_member_location: 48
 <2><20a>: Abbrev Number: 6 (DW_TAG_member)
    <20b>   DW_AT_name        : CR2
    <20f>   DW_AT_decl_file   : 5
    <20f>   DW_AT_decl_line   : 407
    <211>   DW_AT_decl_column : 17
    <211>   DW_AT_type        : <0xa0>
    <215>   DW_AT_data_member_location: 52
 <2><216>: Abbrev Number: 0
 <1><217>: Abbrev Number: 11 (DW_TAG_typedef)
    <218>   DW_AT_name        : (indirect string, offset: 0x3bef1): RCC_TypeDef
    <21c>   DW_AT_decl_file   : 5
    <21d>   DW_AT_decl_line   : 408
    <21f>   DW_AT_decl_column : 3
    <21f>   DW_AT_type        : <0x153>
 <1><223>: Abbrev Number: 3 (DW_TAG_base_type)
    <224>   DW_AT_byte_size   : 8
    <225>   DW_AT_encoding    : 4	(float)
    <226>   DW_AT_name        : (indirect string, offset: 0x144dd): long double
 <1><22a>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <22b>   DW_AT_encoding    : 7	(unsigned)
    <22b>   DW_AT_byte_size   : 1
    <22b>   DW_AT_type        : <0x31>
    <22f>   DW_AT_decl_file   : 6
    <230>   DW_AT_decl_line   : 39
    <231>   DW_AT_decl_column : 1
    <231>   DW_AT_sibling     : <0x24e>
 <2><235>: Abbrev Number: 7 (DW_TAG_enumerator)
    <236>   DW_AT_name        : (indirect string, offset: 0x2b462): HAL_OK
    <23a>   DW_AT_const_value : 0
 <2><23b>: Abbrev Number: 7 (DW_TAG_enumerator)
    <23c>   DW_AT_name        : (indirect string, offset: 0x4fde3): HAL_ERROR
    <240>   DW_AT_const_value : 1
 <2><241>: Abbrev Number: 7 (DW_TAG_enumerator)
    <242>   DW_AT_name        : (indirect string, offset: 0x1648e): HAL_BUSY
    <246>   DW_AT_const_value : 2
 <2><247>: Abbrev Number: 7 (DW_TAG_enumerator)
    <248>   DW_AT_name        : (indirect string, offset: 0x2581d): HAL_TIMEOUT
    <24c>   DW_AT_const_value : 3
 <2><24d>: Abbrev Number: 0
 <1><24e>: Abbrev Number: 4 (DW_TAG_typedef)
    <24f>   DW_AT_name        : (indirect string, offset: 0x16e8): HAL_StatusTypeDef
    <253>   DW_AT_decl_file   : 6
    <254>   DW_AT_decl_line   : 44
    <255>   DW_AT_decl_column : 3
    <256>   DW_AT_type        : <0x22a>
 <1><25a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <25b>   DW_AT_byte_size   : 16
    <25c>   DW_AT_decl_file   : 7
    <25d>   DW_AT_decl_line   : 193
    <25e>   DW_AT_decl_column : 9
    <25e>   DW_AT_sibling     : <0x293>
 <2><262>: Abbrev Number: 1 (DW_TAG_member)
    <263>   DW_AT_name        : (indirect string, offset: 0x55caf): PLLState
    <267>   DW_AT_decl_file   : 7
    <268>   DW_AT_decl_line   : 195
    <269>   DW_AT_decl_column : 12
    <269>   DW_AT_type        : <0x94>
    <26d>   DW_AT_data_member_location: 0
 <2><26e>: Abbrev Number: 1 (DW_TAG_member)
    <26f>   DW_AT_name        : (indirect string, offset: 0x57029): PLLSource
    <273>   DW_AT_decl_file   : 7
    <274>   DW_AT_decl_line   : 198
    <275>   DW_AT_decl_column : 12
    <275>   DW_AT_type        : <0x94>
    <279>   DW_AT_data_member_location: 4
 <2><27a>: Abbrev Number: 1 (DW_TAG_member)
    <27b>   DW_AT_name        : (indirect string, offset: 0x729ad): PLLMUL
    <27f>   DW_AT_decl_file   : 7
    <280>   DW_AT_decl_line   : 201
    <281>   DW_AT_decl_column : 12
    <281>   DW_AT_type        : <0x94>
    <285>   DW_AT_data_member_location: 8
 <2><286>: Abbrev Number: 1 (DW_TAG_member)
    <287>   DW_AT_name        : (indirect string, offset: 0x3c68a): PREDIV
    <28b>   DW_AT_decl_file   : 7
    <28c>   DW_AT_decl_line   : 204
    <28d>   DW_AT_decl_column : 12
    <28d>   DW_AT_type        : <0x94>
    <291>   DW_AT_data_member_location: 12
 <2><292>: Abbrev Number: 0
 <1><293>: Abbrev Number: 4 (DW_TAG_typedef)
    <294>   DW_AT_name        : (indirect string, offset: 0x4d189): RCC_PLLInitTypeDef
    <298>   DW_AT_decl_file   : 7
    <299>   DW_AT_decl_line   : 207
    <29a>   DW_AT_decl_column : 3
    <29b>   DW_AT_type        : <0x25a>
 <1><29f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <2a0>   DW_AT_byte_size   : 52
    <2a1>   DW_AT_decl_file   : 7
    <2a2>   DW_AT_decl_line   : 212
    <2a3>   DW_AT_decl_column : 9
    <2a3>   DW_AT_sibling     : <0x321>
 <2><2a7>: Abbrev Number: 1 (DW_TAG_member)
    <2a8>   DW_AT_name        : (indirect string, offset: 0x68445): OscillatorType
    <2ac>   DW_AT_decl_file   : 7
    <2ad>   DW_AT_decl_line   : 214
    <2ae>   DW_AT_decl_column : 12
    <2ae>   DW_AT_type        : <0x94>
    <2b2>   DW_AT_data_member_location: 0
 <2><2b3>: Abbrev Number: 1 (DW_TAG_member)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x56ef3): HSEState
    <2b8>   DW_AT_decl_file   : 7
    <2b9>   DW_AT_decl_line   : 217
    <2ba>   DW_AT_decl_column : 12
    <2ba>   DW_AT_type        : <0x94>
    <2be>   DW_AT_data_member_location: 4
 <2><2bf>: Abbrev Number: 1 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x50557): LSEState
    <2c4>   DW_AT_decl_file   : 7
    <2c5>   DW_AT_decl_line   : 220
    <2c6>   DW_AT_decl_column : 12
    <2c6>   DW_AT_type        : <0x94>
    <2ca>   DW_AT_data_member_location: 8
 <2><2cb>: Abbrev Number: 1 (DW_TAG_member)
    <2cc>   DW_AT_name        : (indirect string, offset: 0x3977d): HSIState
    <2d0>   DW_AT_decl_file   : 7
    <2d1>   DW_AT_decl_line   : 223
    <2d2>   DW_AT_decl_column : 12
    <2d2>   DW_AT_type        : <0x94>
    <2d6>   DW_AT_data_member_location: 12
 <2><2d7>: Abbrev Number: 1 (DW_TAG_member)
    <2d8>   DW_AT_name        : (indirect string, offset: 0x6e598): HSICalibrationValue
    <2dc>   DW_AT_decl_file   : 7
    <2dd>   DW_AT_decl_line   : 226
    <2de>   DW_AT_decl_column : 12
    <2de>   DW_AT_type        : <0x94>
    <2e2>   DW_AT_data_member_location: 16
 <2><2e3>: Abbrev Number: 1 (DW_TAG_member)
    <2e4>   DW_AT_name        : (indirect string, offset: 0x57329): HSI14State
    <2e8>   DW_AT_decl_file   : 7
    <2e9>   DW_AT_decl_line   : 229
    <2ea>   DW_AT_decl_column : 12
    <2ea>   DW_AT_type        : <0x94>
    <2ee>   DW_AT_data_member_location: 20
 <2><2ef>: Abbrev Number: 1 (DW_TAG_member)
    <2f0>   DW_AT_name        : (indirect string, offset: 0x3401f): HSI14CalibrationValue
    <2f4>   DW_AT_decl_file   : 7
    <2f5>   DW_AT_decl_line   : 232
    <2f6>   DW_AT_decl_column : 12
    <2f6>   DW_AT_type        : <0x94>
    <2fa>   DW_AT_data_member_location: 24
 <2><2fb>: Abbrev Number: 1 (DW_TAG_member)
    <2fc>   DW_AT_name        : (indirect string, offset: 0x72125): LSIState
    <300>   DW_AT_decl_file   : 7
    <301>   DW_AT_decl_line   : 235
    <302>   DW_AT_decl_column : 12
    <302>   DW_AT_type        : <0x94>
    <306>   DW_AT_data_member_location: 28
 <2><307>: Abbrev Number: 1 (DW_TAG_member)
    <308>   DW_AT_name        : (indirect string, offset: 0x5ab50): HSI48State
    <30c>   DW_AT_decl_file   : 7
    <30d>   DW_AT_decl_line   : 239
    <30e>   DW_AT_decl_column : 12
    <30e>   DW_AT_type        : <0x94>
    <312>   DW_AT_data_member_location: 32
 <2><313>: Abbrev Number: 16 (DW_TAG_member)
    <314>   DW_AT_name        : PLL
    <318>   DW_AT_decl_file   : 7
    <319>   DW_AT_decl_line   : 243
    <31a>   DW_AT_decl_column : 22
    <31b>   DW_AT_type        : <0x293>
    <31f>   DW_AT_data_member_location: 36
 <2><320>: Abbrev Number: 0
 <1><321>: Abbrev Number: 4 (DW_TAG_typedef)
    <322>   DW_AT_name        : (indirect string, offset: 0x44503): RCC_OscInitTypeDef
    <326>   DW_AT_decl_file   : 7
    <327>   DW_AT_decl_line   : 245
    <328>   DW_AT_decl_column : 3
    <329>   DW_AT_type        : <0x29f>
 <1><32d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <32e>   DW_AT_byte_size   : 16
    <32f>   DW_AT_decl_file   : 7
    <330>   DW_AT_decl_line   : 250
    <331>   DW_AT_decl_column : 9
    <331>   DW_AT_sibling     : <0x36a>
 <2><335>: Abbrev Number: 1 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x2748f): ClockType
    <33a>   DW_AT_decl_file   : 7
    <33b>   DW_AT_decl_line   : 252
    <33c>   DW_AT_decl_column : 12
    <33c>   DW_AT_type        : <0x94>
    <340>   DW_AT_data_member_location: 0
 <2><341>: Abbrev Number: 1 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x4ce03): SYSCLKSource
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 255
    <348>   DW_AT_decl_column : 12
    <348>   DW_AT_type        : <0x94>
    <34c>   DW_AT_data_member_location: 4
 <2><34d>: Abbrev Number: 2 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0x69f51): AHBCLKDivider
    <352>   DW_AT_decl_file   : 7
    <353>   DW_AT_decl_line   : 258
    <355>   DW_AT_decl_column : 12
    <356>   DW_AT_type        : <0x94>
    <35a>   DW_AT_data_member_location: 8
 <2><35b>: Abbrev Number: 2 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0x4d4c): APB1CLKDivider
    <360>   DW_AT_decl_file   : 7
    <361>   DW_AT_decl_line   : 261
    <363>   DW_AT_decl_column : 12
    <364>   DW_AT_type        : <0x94>
    <368>   DW_AT_data_member_location: 12
 <2><369>: Abbrev Number: 0
 <1><36a>: Abbrev Number: 11 (DW_TAG_typedef)
    <36b>   DW_AT_name        : (indirect string, offset: 0x62e69): RCC_ClkInitTypeDef
    <36f>   DW_AT_decl_file   : 7
    <370>   DW_AT_decl_line   : 264
    <372>   DW_AT_decl_column : 3
    <372>   DW_AT_type        : <0x32d>
 <1><376>: Abbrev Number: 8 (DW_TAG_structure_type)
    <377>   DW_AT_byte_size   : 20
    <378>   DW_AT_decl_file   : 8
    <379>   DW_AT_decl_line   : 46
    <37a>   DW_AT_decl_column : 9
    <37a>   DW_AT_sibling     : <0x3bc>
 <2><37e>: Abbrev Number: 16 (DW_TAG_member)
    <37f>   DW_AT_name        : Pin
    <383>   DW_AT_decl_file   : 8
    <384>   DW_AT_decl_line   : 48
    <385>   DW_AT_decl_column : 12
    <386>   DW_AT_type        : <0x94>
    <38a>   DW_AT_data_member_location: 0
 <2><38b>: Abbrev Number: 1 (DW_TAG_member)
    <38c>   DW_AT_name        : (indirect string, offset: 0x637e4): Mode
    <390>   DW_AT_decl_file   : 8
    <391>   DW_AT_decl_line   : 51
    <392>   DW_AT_decl_column : 12
    <392>   DW_AT_type        : <0x94>
    <396>   DW_AT_data_member_location: 4
 <2><397>: Abbrev Number: 1 (DW_TAG_member)
    <398>   DW_AT_name        : (indirect string, offset: 0x4249b): Pull
    <39c>   DW_AT_decl_file   : 8
    <39d>   DW_AT_decl_line   : 54
    <39e>   DW_AT_decl_column : 12
    <39e>   DW_AT_type        : <0x94>
    <3a2>   DW_AT_data_member_location: 8
 <2><3a3>: Abbrev Number: 1 (DW_TAG_member)
    <3a4>   DW_AT_name        : (indirect string, offset: 0x4ae80): Speed
    <3a8>   DW_AT_decl_file   : 8
    <3a9>   DW_AT_decl_line   : 57
    <3aa>   DW_AT_decl_column : 12
    <3aa>   DW_AT_type        : <0x94>
    <3ae>   DW_AT_data_member_location: 12
 <2><3af>: Abbrev Number: 1 (DW_TAG_member)
    <3b0>   DW_AT_name        : (indirect string, offset: 0x3b145): Alternate
    <3b4>   DW_AT_decl_file   : 8
    <3b5>   DW_AT_decl_line   : 60
    <3b6>   DW_AT_decl_column : 12
    <3b6>   DW_AT_type        : <0x94>
    <3ba>   DW_AT_data_member_location: 16
 <2><3bb>: Abbrev Number: 0
 <1><3bc>: Abbrev Number: 4 (DW_TAG_typedef)
    <3bd>   DW_AT_name        : (indirect string, offset: 0x75e2b): GPIO_InitTypeDef
    <3c1>   DW_AT_decl_file   : 8
    <3c2>   DW_AT_decl_line   : 62
    <3c3>   DW_AT_decl_column : 2
    <3c4>   DW_AT_type        : <0x376>
 <1><3c8>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <3c9>   DW_AT_encoding    : 7	(unsigned)
    <3c9>   DW_AT_byte_size   : 1
    <3c9>   DW_AT_type        : <0x31>
    <3cd>   DW_AT_decl_file   : 8
    <3ce>   DW_AT_decl_line   : 68
    <3cf>   DW_AT_decl_column : 1
    <3cf>   DW_AT_sibling     : <0x3e0>
 <2><3d3>: Abbrev Number: 7 (DW_TAG_enumerator)
    <3d4>   DW_AT_name        : (indirect string, offset: 0x1a587): GPIO_PIN_RESET
    <3d8>   DW_AT_const_value : 0
 <2><3d9>: Abbrev Number: 7 (DW_TAG_enumerator)
    <3da>   DW_AT_name        : (indirect string, offset: 0x2011a): GPIO_PIN_SET
    <3de>   DW_AT_const_value : 1
 <2><3df>: Abbrev Number: 0
 <1><3e0>: Abbrev Number: 4 (DW_TAG_typedef)
    <3e1>   DW_AT_name        : (indirect string, offset: 0x7d4cf): GPIO_PinState
    <3e5>   DW_AT_decl_file   : 8
    <3e6>   DW_AT_decl_line   : 71
    <3e7>   DW_AT_decl_column : 2
    <3e8>   DW_AT_type        : <0x3c8>
 <1><3ec>: Abbrev Number: 12 (DW_TAG_subprogram)
    <3ed>   DW_AT_external    : 1
    <3ed>   DW_AT_name        : (indirect string, offset: 0x4e724): HAL_GPIO_Init
    <3f1>   DW_AT_decl_file   : 8
    <3f2>   DW_AT_decl_line   : 280
    <3f4>   DW_AT_decl_column : 19
    <3f5>   DW_AT_prototyped  : 1
    <3f5>   DW_AT_declaration : 1
    <3f5>   DW_AT_sibling     : <0x404>
 <2><3f9>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <3fa>   DW_AT_type        : <0x404>
 <2><3fe>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <3ff>   DW_AT_type        : <0x409>
 <2><403>: Abbrev Number: 0
 <1><404>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <405>   DW_AT_byte_size   : 4
    <405>   DW_AT_type        : <0x147>
 <1><409>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <40a>   DW_AT_byte_size   : 4
    <40a>   DW_AT_type        : <0x3bc>
 <1><40e>: Abbrev Number: 17 (DW_TAG_subprogram)
    <40f>   DW_AT_external    : 1
    <40f>   DW_AT_name        : (indirect string, offset: 0x6dec0): HAL_RCC_ClockConfig
    <413>   DW_AT_decl_file   : 7
    <413>   DW_AT_decl_line   : 1637
    <415>   DW_AT_decl_column : 19
    <415>   DW_AT_prototyped  : 1
    <415>   DW_AT_type        : <0x24e>
    <419>   DW_AT_declaration : 1
    <419>   DW_AT_sibling     : <0x428>
 <2><41d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <41e>   DW_AT_type        : <0x428>
 <2><422>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <423>   DW_AT_type        : <0x94>
 <2><427>: Abbrev Number: 0
 <1><428>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <429>   DW_AT_byte_size   : 4
    <429>   DW_AT_type        : <0x36a>
 <1><42d>: Abbrev Number: 17 (DW_TAG_subprogram)
    <42e>   DW_AT_external    : 1
    <42e>   DW_AT_name        : (indirect string, offset: 0x1084): HAL_RCC_OscConfig
    <432>   DW_AT_decl_file   : 7
    <432>   DW_AT_decl_line   : 1636
    <434>   DW_AT_decl_column : 19
    <434>   DW_AT_prototyped  : 1
    <434>   DW_AT_type        : <0x24e>
    <438>   DW_AT_declaration : 1
    <438>   DW_AT_sibling     : <0x442>
 <2><43c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <43d>   DW_AT_type        : <0x442>
 <2><441>: Abbrev Number: 0
 <1><442>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <443>   DW_AT_byte_size   : 4
    <443>   DW_AT_type        : <0x321>
 <1><447>: Abbrev Number: 12 (DW_TAG_subprogram)
    <448>   DW_AT_external    : 1
    <448>   DW_AT_name        : (indirect string, offset: 0x16827): HAL_GPIO_WritePin
    <44c>   DW_AT_decl_file   : 8
    <44d>   DW_AT_decl_line   : 293
    <44f>   DW_AT_decl_column : 19
    <450>   DW_AT_prototyped  : 1
    <450>   DW_AT_declaration : 1
    <450>   DW_AT_sibling     : <0x464>
 <2><454>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <455>   DW_AT_type        : <0x404>
 <2><459>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <45a>   DW_AT_type        : <0x88>
 <2><45e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <45f>   DW_AT_type        : <0x3e0>
 <2><463>: Abbrev Number: 0
 <1><464>: Abbrev Number: 12 (DW_TAG_subprogram)
    <465>   DW_AT_external    : 1
    <465>   DW_AT_name        : (indirect string, offset: 0x33233): HAL_Delay
    <469>   DW_AT_decl_file   : 9
    <46a>   DW_AT_decl_line   : 545
    <46c>   DW_AT_decl_column : 21
    <46d>   DW_AT_prototyped  : 1
    <46d>   DW_AT_declaration : 1
    <46d>   DW_AT_sibling     : <0x477>
 <2><471>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <472>   DW_AT_type        : <0x94>
 <2><476>: Abbrev Number: 0
 <1><477>: Abbrev Number: 22 (DW_TAG_subprogram)
    <478>   DW_AT_external    : 1
    <478>   DW_AT_name        : (indirect string, offset: 0x2dd18): HAL_Init
    <47c>   DW_AT_decl_file   : 9
    <47d>   DW_AT_decl_line   : 519
    <47f>   DW_AT_decl_column : 19
    <480>   DW_AT_prototyped  : 1
    <480>   DW_AT_type        : <0x24e>
    <484>   DW_AT_declaration : 1
 <1><484>: Abbrev Number: 23 (DW_TAG_subprogram)
    <485>   DW_AT_external    : 1
    <485>   DW_AT_name        : (indirect string, offset: 0x39069): Error_Handler
    <489>   DW_AT_decl_file   : 1
    <48a>   DW_AT_decl_line   : 181
    <48b>   DW_AT_decl_column : 6
    <48c>   DW_AT_prototyped  : 1
    <48c>   DW_AT_low_pc      : 0x8000354
    <490>   DW_AT_high_pc     : 0xc
    <494>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <496>   DW_AT_call_all_calls: 1
    <496>   DW_AT_sibling     : <0x4ab>
 <2><49a>: Abbrev Number: 24 (DW_TAG_inlined_subroutine)
    <49b>   DW_AT_abstract_origin: <0x533>
    <49f>   DW_AT_low_pc      : 0x8000358
    <4a3>   DW_AT_high_pc     : 0x4
    <4a7>   DW_AT_call_file   : 1
    <4a8>   DW_AT_call_line   : 185
    <4a9>   DW_AT_call_column : 3
 <2><4aa>: Abbrev Number: 0
 <1><4ab>: Abbrev Number: 25 (DW_TAG_subprogram)
    <4ac>   DW_AT_name        : (indirect string, offset: 0x345c8): MX_GPIO_Init
    <4b0>   DW_AT_decl_file   : 1
    <4b1>   DW_AT_decl_line   : 148
    <4b2>   DW_AT_decl_column : 13
    <4b3>   DW_AT_prototyped  : 1
    <4b3>   DW_AT_low_pc      : 0x80002e4
    <4b7>   DW_AT_high_pc     : 0x70
    <4bb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4bd>   DW_AT_call_all_tail_calls: 1
    <4bd>   DW_AT_sibling     : <0x4e8>
 <2><4c1>: Abbrev Number: 10 (DW_TAG_variable)
    <4c2>   DW_AT_name        : (indirect string, offset: 0xc88f): GPIO_InitStruct
    <4c6>   DW_AT_decl_file   : 1
    <4c6>   DW_AT_decl_line   : 150
    <4c7>   DW_AT_decl_column : 20
    <4c8>   DW_AT_type        : <0x3bc>
    <4cc>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><4cf>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <4d0>   DW_AT_low_pc      : 0x80002f8
    <4d4>   DW_AT_high_pc     : 0x1c
 <3><4d8>: Abbrev Number: 10 (DW_TAG_variable)
    <4d9>   DW_AT_name        : (indirect string, offset: 0x355d9): tmpreg
    <4dd>   DW_AT_decl_file   : 1
    <4dd>   DW_AT_decl_line   : 156
    <4de>   DW_AT_decl_column : 3
    <4df>   DW_AT_type        : <0xa0>
    <4e3>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><4e6>: Abbrev Number: 0
 <2><4e7>: Abbrev Number: 0
 <1><4e8>: Abbrev Number: 27 (DW_TAG_subprogram)
    <4e9>   DW_AT_external    : 1
    <4e9>   DW_AT_name        : (indirect string, offset: 0x58891): SystemClock_Config
    <4ed>   DW_AT_decl_file   : 1
    <4ee>   DW_AT_decl_line   : 112
    <4ef>   DW_AT_decl_column : 6
    <4f0>   DW_AT_prototyped  : 1
    <4f0>   DW_AT_low_pc      : 0x8000264
    <4f4>   DW_AT_high_pc     : 0x80
    <4f8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4fa>   DW_AT_call_all_tail_calls: 1
    <4fa>   DW_AT_sibling     : <0x51d>
 <2><4fe>: Abbrev Number: 10 (DW_TAG_variable)
    <4ff>   DW_AT_name        : (indirect string, offset: 0x1bbdd): RCC_OscInitStruct
    <503>   DW_AT_decl_file   : 1
    <503>   DW_AT_decl_line   : 114
    <504>   DW_AT_decl_column : 22
    <505>   DW_AT_type        : <0x321>
    <509>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><50d>: Abbrev Number: 10 (DW_TAG_variable)
    <50e>   DW_AT_name        : (indirect string, offset: 0x303b5): RCC_ClkInitStruct
    <512>   DW_AT_decl_file   : 1
    <512>   DW_AT_decl_line   : 115
    <513>   DW_AT_decl_column : 22
    <514>   DW_AT_type        : <0x36a>
    <518>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <2><51c>: Abbrev Number: 0
 <1><51d>: Abbrev Number: 28 (DW_TAG_subprogram)
    <51e>   DW_AT_external    : 1
    <51e>   DW_AT_name        : (indirect string, offset: 0xcd4b): main
    <522>   DW_AT_decl_file   : 1
    <523>   DW_AT_decl_line   : 64
    <524>   DW_AT_decl_column : 5
    <525>   DW_AT_prototyped  : 1
    <525>   DW_AT_type        : <0x7a>
    <529>   DW_AT_low_pc      : 0x8000220
    <52d>   DW_AT_high_pc     : 0x44
    <531>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <533>   DW_AT_call_all_tail_calls: 1
 <1><533>: Abbrev Number: 29 (DW_TAG_subprogram)
    <534>   DW_AT_name        : (indirect string, offset: 0x46d83): __disable_irq
    <538>   DW_AT_decl_file   : 2
    <539>   DW_AT_decl_line   : 140
    <53a>   DW_AT_decl_column : 27
    <53b>   DW_AT_prototyped  : 1
    <53b>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><53c>: Abbrev Number: 0
  Compilation Unit @ offset 0x53d:
   Length:        0x195 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1e6
   Pointer Size:  4
 <0><549>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <54a>   DW_AT_producer    : (indirect string, offset: 0x3958d): GNU C11 13.3.1 20240614 -mcpu=cortex-m0 -mfloat-abi=soft -mthumb -march=armv6s-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <54e>   DW_AT_language    : 29	(C11)
    <54f>   DW_AT_name        : (indirect string, offset: 0x7ff30): ../Core/Src/stm32f0xx_hal_msp.c
    <553>   DW_AT_comp_dir    : (indirect string, offset: 0x1a017): C:/Users/andre/Desktop/E2A S2/Progeto_di_semestre/3_Design/FW/Debug
    <557>   DW_AT_ranges      : 0x32
    <55b>   DW_AT_low_pc      : 0
    <55f>   DW_AT_stmt_list   : 0x796
    <563>   DW_AT_macros      : 0x15cdc
 <1><567>: Abbrev Number: 1 (DW_TAG_base_type)
    <568>   DW_AT_byte_size   : 1
    <569>   DW_AT_encoding    : 6	(signed char)
    <56a>   DW_AT_name        : (indirect string, offset: 0x4072a): signed char
 <1><56e>: Abbrev Number: 1 (DW_TAG_base_type)
    <56f>   DW_AT_byte_size   : 1
    <570>   DW_AT_encoding    : 8	(unsigned char)
    <571>   DW_AT_name        : (indirect string, offset: 0x5c9c8): unsigned char
 <1><575>: Abbrev Number: 1 (DW_TAG_base_type)
    <576>   DW_AT_byte_size   : 2
    <577>   DW_AT_encoding    : 5	(signed)
    <578>   DW_AT_name        : (indirect string, offset: 0x5f2bc): short int
 <1><57c>: Abbrev Number: 1 (DW_TAG_base_type)
    <57d>   DW_AT_byte_size   : 2
    <57e>   DW_AT_encoding    : 7	(unsigned)
    <57f>   DW_AT_name        : (indirect string, offset: 0x7a239): short unsigned int
 <1><583>: Abbrev Number: 1 (DW_TAG_base_type)
    <584>   DW_AT_byte_size   : 4
    <585>   DW_AT_encoding    : 5	(signed)
    <586>   DW_AT_name        : (indirect string, offset: 0xb0b0): long int
 <1><58a>: Abbrev Number: 4 (DW_TAG_typedef)
    <58b>   DW_AT_name        : (indirect string, offset: 0x5166f): __uint32_t
    <58f>   DW_AT_decl_file   : 2
    <590>   DW_AT_decl_line   : 79
    <591>   DW_AT_decl_column : 25
    <592>   DW_AT_type        : <0x596>
 <1><596>: Abbrev Number: 1 (DW_TAG_base_type)
    <597>   DW_AT_byte_size   : 4
    <598>   DW_AT_encoding    : 7	(unsigned)
    <599>   DW_AT_name        : (indirect string, offset: 0x440c0): long unsigned int
 <1><59d>: Abbrev Number: 1 (DW_TAG_base_type)
    <59e>   DW_AT_byte_size   : 8
    <59f>   DW_AT_encoding    : 5	(signed)
    <5a0>   DW_AT_name        : (indirect string, offset: 0x3ad4b): long long int
 <1><5a4>: Abbrev Number: 1 (DW_TAG_base_type)
    <5a5>   DW_AT_byte_size   : 8
    <5a6>   DW_AT_encoding    : 7	(unsigned)
    <5a7>   DW_AT_name        : (indirect string, offset: 0x1a7f2): long long unsigned int
 <1><5ab>: Abbrev Number: 7 (DW_TAG_base_type)
    <5ac>   DW_AT_byte_size   : 4
    <5ad>   DW_AT_encoding    : 5	(signed)
    <5ae>   DW_AT_name        : int
 <1><5b2>: Abbrev Number: 1 (DW_TAG_base_type)
    <5b3>   DW_AT_byte_size   : 4
    <5b4>   DW_AT_encoding    : 7	(unsigned)
    <5b5>   DW_AT_name        : (indirect string, offset: 0xaaa9): unsigned int
 <1><5b9>: Abbrev Number: 4 (DW_TAG_typedef)
    <5ba>   DW_AT_name        : (indirect string, offset: 0x51671): uint32_t
    <5be>   DW_AT_decl_file   : 3
    <5bf>   DW_AT_decl_line   : 48
    <5c0>   DW_AT_decl_column : 20
    <5c1>   DW_AT_type        : <0x58a>
 <1><5c5>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <5c6>   DW_AT_type        : <0x5b9>
 <1><5ca>: Abbrev Number: 9 (DW_TAG_structure_type)
    <5cb>   DW_AT_byte_size   : 56
    <5cc>   DW_AT_decl_file   : 4
    <5cd>   DW_AT_decl_line   : 392
    <5cf>   DW_AT_decl_column : 9
    <5d0>   DW_AT_sibling     : <0x67c>
 <2><5d4>: Abbrev Number: 3 (DW_TAG_member)
    <5d5>   DW_AT_name        : CR
    <5d8>   DW_AT_decl_file   : 4
    <5d8>   DW_AT_decl_line   : 394
    <5da>   DW_AT_decl_column : 17
    <5da>   DW_AT_type        : <0x5c5>
    <5de>   DW_AT_data_member_location: 0
 <2><5df>: Abbrev Number: 2 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x4d467): CFGR
    <5e4>   DW_AT_decl_file   : 4
    <5e4>   DW_AT_decl_line   : 395
    <5e6>   DW_AT_decl_column : 17
    <5e6>   DW_AT_type        : <0x5c5>
    <5ea>   DW_AT_data_member_location: 4
 <2><5eb>: Abbrev Number: 3 (DW_TAG_member)
    <5ec>   DW_AT_name        : CIR
    <5f0>   DW_AT_decl_file   : 4
    <5f0>   DW_AT_decl_line   : 396
    <5f2>   DW_AT_decl_column : 17
    <5f2>   DW_AT_type        : <0x5c5>
    <5f6>   DW_AT_data_member_location: 8
 <2><5f7>: Abbrev Number: 2 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x37e96): APB2RSTR
    <5fc>   DW_AT_decl_file   : 4
    <5fc>   DW_AT_decl_line   : 397
    <5fe>   DW_AT_decl_column : 17
    <5fe>   DW_AT_type        : <0x5c5>
    <602>   DW_AT_data_member_location: 12
 <2><603>: Abbrev Number: 2 (DW_TAG_member)
    <604>   DW_AT_name        : (indirect string, offset: 0xe84d): APB1RSTR
    <608>   DW_AT_decl_file   : 4
    <608>   DW_AT_decl_line   : 398
    <60a>   DW_AT_decl_column : 17
    <60a>   DW_AT_type        : <0x5c5>
    <60e>   DW_AT_data_member_location: 16
 <2><60f>: Abbrev Number: 2 (DW_TAG_member)
    <610>   DW_AT_name        : (indirect string, offset: 0xbeae): AHBENR
    <614>   DW_AT_decl_file   : 4
    <614>   DW_AT_decl_line   : 399
    <616>   DW_AT_decl_column : 17
    <616>   DW_AT_type        : <0x5c5>
    <61a>   DW_AT_data_member_location: 20
 <2><61b>: Abbrev Number: 2 (DW_TAG_member)
    <61c>   DW_AT_name        : (indirect string, offset: 0xf1b6): APB2ENR
    <620>   DW_AT_decl_file   : 4
    <620>   DW_AT_decl_line   : 400
    <622>   DW_AT_decl_column : 17
    <622>   DW_AT_type        : <0x5c5>
    <626>   DW_AT_data_member_location: 24
 <2><627>: Abbrev Number: 2 (DW_TAG_member)
    <628>   DW_AT_name        : (indirect string, offset: 0x604b9): APB1ENR
    <62c>   DW_AT_decl_file   : 4
    <62c>   DW_AT_decl_line   : 401
    <62e>   DW_AT_decl_column : 17
    <62e>   DW_AT_type        : <0x5c5>
    <632>   DW_AT_data_member_location: 28
 <2><633>: Abbrev Number: 2 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0x11b42): BDCR
    <638>   DW_AT_decl_file   : 4
    <638>   DW_AT_decl_line   : 402
    <63a>   DW_AT_decl_column : 17
    <63a>   DW_AT_type        : <0x5c5>
    <63e>   DW_AT_data_member_location: 32
 <2><63f>: Abbrev Number: 3 (DW_TAG_member)
    <640>   DW_AT_name        : CSR
    <644>   DW_AT_decl_file   : 4
    <644>   DW_AT_decl_line   : 403
    <646>   DW_AT_decl_column : 17
    <646>   DW_AT_type        : <0x5c5>
    <64a>   DW_AT_data_member_location: 36
 <2><64b>: Abbrev Number: 2 (DW_TAG_member)
    <64c>   DW_AT_name        : (indirect string, offset: 0xa995): AHBRSTR
    <650>   DW_AT_decl_file   : 4
    <650>   DW_AT_decl_line   : 404
    <652>   DW_AT_decl_column : 17
    <652>   DW_AT_type        : <0x5c5>
    <656>   DW_AT_data_member_location: 40
 <2><657>: Abbrev Number: 2 (DW_TAG_member)
    <658>   DW_AT_name        : (indirect string, offset: 0x4b011): CFGR2
    <65c>   DW_AT_decl_file   : 4
    <65c>   DW_AT_decl_line   : 405
    <65e>   DW_AT_decl_column : 17
    <65e>   DW_AT_type        : <0x5c5>
    <662>   DW_AT_data_member_location: 44
 <2><663>: Abbrev Number: 2 (DW_TAG_member)
    <664>   DW_AT_name        : (indirect string, offset: 0x4b017): CFGR3
    <668>   DW_AT_decl_file   : 4
    <668>   DW_AT_decl_line   : 406
    <66a>   DW_AT_decl_column : 17
    <66a>   DW_AT_type        : <0x5c5>
    <66e>   DW_AT_data_member_location: 48
 <2><66f>: Abbrev Number: 3 (DW_TAG_member)
    <670>   DW_AT_name        : CR2
    <674>   DW_AT_decl_file   : 4
    <674>   DW_AT_decl_line   : 407
    <676>   DW_AT_decl_column : 17
    <676>   DW_AT_type        : <0x5c5>
    <67a>   DW_AT_data_member_location: 52
 <2><67b>: Abbrev Number: 0
 <1><67c>: Abbrev Number: 10 (DW_TAG_typedef)
    <67d>   DW_AT_name        : (indirect string, offset: 0x3bef1): RCC_TypeDef
    <681>   DW_AT_decl_file   : 4
    <682>   DW_AT_decl_line   : 408
    <684>   DW_AT_decl_column : 3
    <685>   DW_AT_type        : <0x5ca>
 <1><689>: Abbrev Number: 1 (DW_TAG_base_type)
    <68a>   DW_AT_byte_size   : 8
    <68b>   DW_AT_encoding    : 4	(float)
    <68c>   DW_AT_name        : (indirect string, offset: 0x144dd): long double
 <1><690>: Abbrev Number: 11 (DW_TAG_subprogram)
    <691>   DW_AT_external    : 1
    <691>   DW_AT_name        : (indirect string, offset: 0x7ff50): HAL_MspInit
    <695>   DW_AT_decl_file   : 1
    <696>   DW_AT_decl_line   : 63
    <697>   DW_AT_decl_column : 6
    <698>   DW_AT_prototyped  : 1
    <698>   DW_AT_low_pc      : 0x8000360
    <69c>   DW_AT_high_pc     : 0x48
    <6a0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6a2>   DW_AT_call_all_calls: 1
 <2><6a2>: Abbrev Number: 12 (DW_TAG_lexical_block)
    <6a3>   DW_AT_low_pc      : 0x8000366
    <6a7>   DW_AT_high_pc     : 0x18
    <6ab>   DW_AT_sibling     : <0x6bd>
 <3><6af>: Abbrev Number: 5 (DW_TAG_variable)
    <6b0>   DW_AT_name        : (indirect string, offset: 0x355d9): tmpreg
    <6b4>   DW_AT_decl_file   : 1
    <6b4>   DW_AT_decl_line   : 70
    <6b5>   DW_AT_decl_column : 3
    <6b5>   DW_AT_type        : <0x5c5>
    <6b9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><6bc>: Abbrev Number: 0
 <2><6bd>: Abbrev Number: 13 (DW_TAG_lexical_block)
    <6be>   DW_AT_low_pc      : 0x800037e
    <6c2>   DW_AT_high_pc     : 0x1c
 <3><6c6>: Abbrev Number: 5 (DW_TAG_variable)
    <6c7>   DW_AT_name        : (indirect string, offset: 0x355d9): tmpreg
    <6cb>   DW_AT_decl_file   : 1
    <6cb>   DW_AT_decl_line   : 71
    <6cc>   DW_AT_decl_column : 3
    <6cc>   DW_AT_type        : <0x5c5>
    <6d0>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><6d3>: Abbrev Number: 0
 <2><6d4>: Abbrev Number: 0
 <1><6d5>: Abbrev Number: 0
  Compilation Unit @ offset 0x6d6:
   Length:        0xcf (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x2ac
   Pointer Size:  4
 <0><6e2>: Abbrev Number: 3 (DW_TAG_compile_unit)
    <6e3>   DW_AT_producer    : (indirect string, offset: 0x3958d): GNU C11 13.3.1 20240614 -mcpu=cortex-m0 -mfloat-abi=soft -mthumb -march=armv6s-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <6e7>   DW_AT_language    : 29	(C11)
    <6e8>   DW_AT_name        : (indirect string, offset: 0x7ffc3): ../Core/Src/stm32f0xx_it.c
    <6ec>   DW_AT_comp_dir    : (indirect string, offset: 0x1a017): C:/Users/andre/Desktop/E2A S2/Progeto_di_semestre/3_Design/FW/Debug
    <6f0>   DW_AT_ranges      : 0x45
    <6f4>   DW_AT_low_pc      : 0
    <6f8>   DW_AT_stmt_list   : 0xe94
    <6fc>   DW_AT_macros      : 0x15e85
 <1><700>: Abbrev Number: 1 (DW_TAG_base_type)
    <701>   DW_AT_byte_size   : 1
    <702>   DW_AT_encoding    : 6	(signed char)
    <703>   DW_AT_name        : (indirect string, offset: 0x4072a): signed char
 <1><707>: Abbrev Number: 1 (DW_TAG_base_type)
    <708>   DW_AT_byte_size   : 1
    <709>   DW_AT_encoding    : 8	(unsigned char)
    <70a>   DW_AT_name        : (indirect string, offset: 0x5c9c8): unsigned char
 <1><70e>: Abbrev Number: 1 (DW_TAG_base_type)
    <70f>   DW_AT_byte_size   : 2
    <710>   DW_AT_encoding    : 5	(signed)
    <711>   DW_AT_name        : (indirect string, offset: 0x5f2bc): short int
 <1><715>: Abbrev Number: 1 (DW_TAG_base_type)
    <716>   DW_AT_byte_size   : 2
    <717>   DW_AT_encoding    : 7	(unsigned)
    <718>   DW_AT_name        : (indirect string, offset: 0x7a239): short unsigned int
 <1><71c>: Abbrev Number: 1 (DW_TAG_base_type)
    <71d>   DW_AT_byte_size   : 4
    <71e>   DW_AT_encoding    : 5	(signed)
    <71f>   DW_AT_name        : (indirect string, offset: 0xb0b0): long int
 <1><723>: Abbrev Number: 1 (DW_TAG_base_type)
    <724>   DW_AT_byte_size   : 4
    <725>   DW_AT_encoding    : 7	(unsigned)
    <726>   DW_AT_name        : (indirect string, offset: 0x440c0): long unsigned int
 <1><72a>: Abbrev Number: 1 (DW_TAG_base_type)
    <72b>   DW_AT_byte_size   : 8
    <72c>   DW_AT_encoding    : 5	(signed)
    <72d>   DW_AT_name        : (indirect string, offset: 0x3ad4b): long long int
 <1><731>: Abbrev Number: 1 (DW_TAG_base_type)
    <732>   DW_AT_byte_size   : 8
    <733>   DW_AT_encoding    : 7	(unsigned)
    <734>   DW_AT_name        : (indirect string, offset: 0x1a7f2): long long unsigned int
 <1><738>: Abbrev Number: 4 (DW_TAG_base_type)
    <739>   DW_AT_byte_size   : 4
    <73a>   DW_AT_encoding    : 5	(signed)
    <73b>   DW_AT_name        : int
 <1><73f>: Abbrev Number: 1 (DW_TAG_base_type)
    <740>   DW_AT_byte_size   : 4
    <741>   DW_AT_encoding    : 7	(unsigned)
    <742>   DW_AT_name        : (indirect string, offset: 0xaaa9): unsigned int
 <1><746>: Abbrev Number: 1 (DW_TAG_base_type)
    <747>   DW_AT_byte_size   : 8
    <748>   DW_AT_encoding    : 4	(float)
    <749>   DW_AT_name        : (indirect string, offset: 0x144dd): long double
 <1><74d>: Abbrev Number: 5 (DW_TAG_subprogram)
    <74e>   DW_AT_external    : 1
    <74e>   DW_AT_name        : (indirect string, offset: 0x7ff78): HAL_IncTick
    <752>   DW_AT_decl_file   : 2
    <753>   DW_AT_decl_line   : 544
    <755>   DW_AT_decl_column : 21
    <756>   DW_AT_prototyped  : 1
    <756>   DW_AT_declaration : 1
 <1><756>: Abbrev Number: 6 (DW_TAG_subprogram)
    <757>   DW_AT_external    : 1
    <757>   DW_AT_name        : (indirect string, offset: 0x7ff68): SysTick_Handler
    <75b>   DW_AT_decl_file   : 1
    <75c>   DW_AT_decl_line   : 125
    <75d>   DW_AT_decl_column : 6
    <75e>   DW_AT_prototyped  : 1
    <75e>   DW_AT_low_pc      : 0x80003cc
    <762>   DW_AT_high_pc     : 0xe
    <766>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <768>   DW_AT_call_all_tail_calls: 1
 <1><768>: Abbrev Number: 2 (DW_TAG_subprogram)
    <769>   DW_AT_external    : 1
    <769>   DW_AT_name        : (indirect string, offset: 0x7ffb4): PendSV_Handler
    <76d>   DW_AT_decl_file   : 1
    <76d>   DW_AT_decl_line   : 112
    <76e>   DW_AT_decl_column : 6
    <76e>   DW_AT_prototyped  : 1
    <76e>   DW_AT_low_pc      : 0x80003c2
    <772>   DW_AT_high_pc     : 0xa
    <776>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <778>   DW_AT_call_all_calls: 1
 <1><778>: Abbrev Number: 2 (DW_TAG_subprogram)
    <779>   DW_AT_external    : 1
    <779>   DW_AT_name        : (indirect string, offset: 0x7ff84): SVC_Handler
    <77d>   DW_AT_decl_file   : 1
    <77d>   DW_AT_decl_line   : 99
    <77e>   DW_AT_decl_column : 6
    <77e>   DW_AT_prototyped  : 1
    <77e>   DW_AT_low_pc      : 0x80003b8
    <782>   DW_AT_high_pc     : 0xa
    <786>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <788>   DW_AT_call_all_calls: 1
 <1><788>: Abbrev Number: 2 (DW_TAG_subprogram)
    <789>   DW_AT_external    : 1
    <789>   DW_AT_name        : (indirect string, offset: 0x7ff90): HardFault_Handler
    <78d>   DW_AT_decl_file   : 1
    <78d>   DW_AT_decl_line   : 84
    <78e>   DW_AT_decl_column : 6
    <78e>   DW_AT_prototyped  : 1
    <78e>   DW_AT_low_pc      : 0x80003b0
    <792>   DW_AT_high_pc     : 0x8
    <796>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <798>   DW_AT_call_all_calls: 1
 <1><798>: Abbrev Number: 2 (DW_TAG_subprogram)
    <799>   DW_AT_external    : 1
    <799>   DW_AT_name        : (indirect string, offset: 0x7ff5c): NMI_Handler
    <79d>   DW_AT_decl_file   : 1
    <79d>   DW_AT_decl_line   : 69
    <79e>   DW_AT_decl_column : 6
    <79e>   DW_AT_prototyped  : 1
    <79e>   DW_AT_low_pc      : 0x80003a8
    <7a2>   DW_AT_high_pc     : 0x8
    <7a6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7a8>   DW_AT_call_all_calls: 1
 <1><7a8>: Abbrev Number: 0
  Compilation Unit @ offset 0x7a9:
   Length:        0x23e (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x31f
   Pointer Size:  4
 <0><7b5>: Abbrev Number: 11 (DW_TAG_compile_unit)
    <7b6>   DW_AT_producer    : (indirect string, offset: 0x3958d): GNU C11 13.3.1 20240614 -mcpu=cortex-m0 -mfloat-abi=soft -mthumb -march=armv6s-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <7ba>   DW_AT_language    : 29	(C11)
    <7bb>   DW_AT_name        : (indirect string, offset: 0x7fff4): ../Core/Src/system_stm32f0xx.c
    <7bf>   DW_AT_comp_dir    : (indirect string, offset: 0x1a017): C:/Users/andre/Desktop/E2A S2/Progeto_di_semestre/3_Design/FW/Debug
    <7c3>   DW_AT_ranges      : 0x70
    <7c7>   DW_AT_low_pc      : 0
    <7cb>   DW_AT_stmt_list   : 0x15ef
    <7cf>   DW_AT_macros      : 0x16038
 <1><7d3>: Abbrev Number: 1 (DW_TAG_base_type)
    <7d4>   DW_AT_byte_size   : 1
    <7d5>   DW_AT_encoding    : 6	(signed char)
    <7d6>   DW_AT_name        : (indirect string, offset: 0x4072a): signed char
 <1><7da>: Abbrev Number: 3 (DW_TAG_typedef)
    <7db>   DW_AT_name        : (indirect string, offset: 0x80013): __uint8_t
    <7df>   DW_AT_decl_file   : 2
    <7e0>   DW_AT_decl_line   : 43
    <7e1>   DW_AT_decl_column : 24
    <7e2>   DW_AT_type        : <0x7e6>
 <1><7e6>: Abbrev Number: 1 (DW_TAG_base_type)
    <7e7>   DW_AT_byte_size   : 1
    <7e8>   DW_AT_encoding    : 8	(unsigned char)
    <7e9>   DW_AT_name        : (indirect string, offset: 0x5c9c8): unsigned char
 <1><7ed>: Abbrev Number: 1 (DW_TAG_base_type)
    <7ee>   DW_AT_byte_size   : 2
    <7ef>   DW_AT_encoding    : 5	(signed)
    <7f0>   DW_AT_name        : (indirect string, offset: 0x5f2bc): short int
 <1><7f4>: Abbrev Number: 1 (DW_TAG_base_type)
    <7f5>   DW_AT_byte_size   : 2
    <7f6>   DW_AT_encoding    : 7	(unsigned)
    <7f7>   DW_AT_name        : (indirect string, offset: 0x7a239): short unsigned int
 <1><7fb>: Abbrev Number: 1 (DW_TAG_base_type)
    <7fc>   DW_AT_byte_size   : 4
    <7fd>   DW_AT_encoding    : 5	(signed)
    <7fe>   DW_AT_name        : (indirect string, offset: 0xb0b0): long int
 <1><802>: Abbrev Number: 3 (DW_TAG_typedef)
    <803>   DW_AT_name        : (indirect string, offset: 0x5166f): __uint32_t
    <807>   DW_AT_decl_file   : 2
    <808>   DW_AT_decl_line   : 79
    <809>   DW_AT_decl_column : 25
    <80a>   DW_AT_type        : <0x80e>
 <1><80e>: Abbrev Number: 1 (DW_TAG_base_type)
    <80f>   DW_AT_byte_size   : 4
    <810>   DW_AT_encoding    : 7	(unsigned)
    <811>   DW_AT_name        : (indirect string, offset: 0x440c0): long unsigned int
 <1><815>: Abbrev Number: 1 (DW_TAG_base_type)
    <816>   DW_AT_byte_size   : 8
    <817>   DW_AT_encoding    : 5	(signed)
    <818>   DW_AT_name        : (indirect string, offset: 0x3ad4b): long long int
 <1><81c>: Abbrev Number: 1 (DW_TAG_base_type)
    <81d>   DW_AT_byte_size   : 8
    <81e>   DW_AT_encoding    : 7	(unsigned)
    <81f>   DW_AT_name        : (indirect string, offset: 0x1a7f2): long long unsigned int
 <1><823>: Abbrev Number: 12 (DW_TAG_base_type)
    <824>   DW_AT_byte_size   : 4
    <825>   DW_AT_encoding    : 5	(signed)
    <826>   DW_AT_name        : int
 <1><82a>: Abbrev Number: 1 (DW_TAG_base_type)
    <82b>   DW_AT_byte_size   : 4
    <82c>   DW_AT_encoding    : 7	(unsigned)
    <82d>   DW_AT_name        : (indirect string, offset: 0xaaa9): unsigned int
 <1><831>: Abbrev Number: 3 (DW_TAG_typedef)
    <832>   DW_AT_name        : (indirect string, offset: 0x80015): uint8_t
    <836>   DW_AT_decl_file   : 3
    <837>   DW_AT_decl_line   : 24
    <838>   DW_AT_decl_column : 19
    <839>   DW_AT_type        : <0x7da>
 <1><83d>: Abbrev Number: 5 (DW_TAG_const_type)
    <83e>   DW_AT_type        : <0x831>
 <1><842>: Abbrev Number: 3 (DW_TAG_typedef)
    <843>   DW_AT_name        : (indirect string, offset: 0x51671): uint32_t
    <847>   DW_AT_decl_file   : 3
    <848>   DW_AT_decl_line   : 48
    <849>   DW_AT_decl_column : 20
    <84a>   DW_AT_type        : <0x802>
 <1><84e>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <84f>   DW_AT_type        : <0x842>
 <1><853>: Abbrev Number: 6 (DW_TAG_variable)
    <854>   DW_AT_name        : (indirect string, offset: 0x8003c): SystemCoreClock
    <858>   DW_AT_decl_file   : 4
    <858>   DW_AT_decl_line   : 56
    <859>   DW_AT_decl_column : 17
    <85a>   DW_AT_type        : <0x842>
    <85e>   DW_AT_external    : 1
    <85e>   DW_AT_declaration : 1
 <1><85e>: Abbrev Number: 9 (DW_TAG_array_type)
    <85f>   DW_AT_type        : <0x83d>
    <863>   DW_AT_sibling     : <0x86e>
 <2><867>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <868>   DW_AT_type        : <0x82a>
    <86c>   DW_AT_upper_bound : 15
 <2><86d>: Abbrev Number: 0
 <1><86e>: Abbrev Number: 5 (DW_TAG_const_type)
    <86f>   DW_AT_type        : <0x85e>
 <1><873>: Abbrev Number: 6 (DW_TAG_variable)
    <874>   DW_AT_name        : (indirect string, offset: 0x80057): AHBPrescTable
    <878>   DW_AT_decl_file   : 4
    <878>   DW_AT_decl_line   : 57
    <879>   DW_AT_decl_column : 22
    <87a>   DW_AT_type        : <0x86e>
    <87e>   DW_AT_external    : 1
    <87e>   DW_AT_declaration : 1
 <1><87e>: Abbrev Number: 9 (DW_TAG_array_type)
    <87f>   DW_AT_type        : <0x83d>
    <883>   DW_AT_sibling     : <0x88e>
 <2><887>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <888>   DW_AT_type        : <0x82a>
    <88c>   DW_AT_upper_bound : 7
 <2><88d>: Abbrev Number: 0
 <1><88e>: Abbrev Number: 5 (DW_TAG_const_type)
    <88f>   DW_AT_type        : <0x87e>
 <1><893>: Abbrev Number: 6 (DW_TAG_variable)
    <894>   DW_AT_name        : (indirect string, offset: 0x80065): APBPrescTable
    <898>   DW_AT_decl_file   : 4
    <898>   DW_AT_decl_line   : 58
    <899>   DW_AT_decl_column : 22
    <89a>   DW_AT_type        : <0x88e>
    <89e>   DW_AT_external    : 1
    <89e>   DW_AT_declaration : 1
 <1><89e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <89f>   DW_AT_byte_size   : 56
    <8a0>   DW_AT_decl_file   : 5
    <8a1>   DW_AT_decl_line   : 392
    <8a3>   DW_AT_decl_column : 9
    <8a4>   DW_AT_sibling     : <0x950>
 <2><8a8>: Abbrev Number: 4 (DW_TAG_member)
    <8a9>   DW_AT_name        : CR
    <8ac>   DW_AT_decl_file   : 5
    <8ac>   DW_AT_decl_line   : 394
    <8ae>   DW_AT_decl_column : 17
    <8ae>   DW_AT_type        : <0x84e>
    <8b2>   DW_AT_data_member_location: 0
 <2><8b3>: Abbrev Number: 2 (DW_TAG_member)
    <8b4>   DW_AT_name        : (indirect string, offset: 0x4d467): CFGR
    <8b8>   DW_AT_decl_file   : 5
    <8b8>   DW_AT_decl_line   : 395
    <8ba>   DW_AT_decl_column : 17
    <8ba>   DW_AT_type        : <0x84e>
    <8be>   DW_AT_data_member_location: 4
 <2><8bf>: Abbrev Number: 4 (DW_TAG_member)
    <8c0>   DW_AT_name        : CIR
    <8c4>   DW_AT_decl_file   : 5
    <8c4>   DW_AT_decl_line   : 396
    <8c6>   DW_AT_decl_column : 17
    <8c6>   DW_AT_type        : <0x84e>
    <8ca>   DW_AT_data_member_location: 8
 <2><8cb>: Abbrev Number: 2 (DW_TAG_member)
    <8cc>   DW_AT_name        : (indirect string, offset: 0x37e96): APB2RSTR
    <8d0>   DW_AT_decl_file   : 5
    <8d0>   DW_AT_decl_line   : 397
    <8d2>   DW_AT_decl_column : 17
    <8d2>   DW_AT_type        : <0x84e>
    <8d6>   DW_AT_data_member_location: 12
 <2><8d7>: Abbrev Number: 2 (DW_TAG_member)
    <8d8>   DW_AT_name        : (indirect string, offset: 0xe84d): APB1RSTR
    <8dc>   DW_AT_decl_file   : 5
    <8dc>   DW_AT_decl_line   : 398
    <8de>   DW_AT_decl_column : 17
    <8de>   DW_AT_type        : <0x84e>
    <8e2>   DW_AT_data_member_location: 16
 <2><8e3>: Abbrev Number: 2 (DW_TAG_member)
    <8e4>   DW_AT_name        : (indirect string, offset: 0xbeae): AHBENR
    <8e8>   DW_AT_decl_file   : 5
    <8e8>   DW_AT_decl_line   : 399
    <8ea>   DW_AT_decl_column : 17
    <8ea>   DW_AT_type        : <0x84e>
    <8ee>   DW_AT_data_member_location: 20
 <2><8ef>: Abbrev Number: 2 (DW_TAG_member)
    <8f0>   DW_AT_name        : (indirect string, offset: 0xf1b6): APB2ENR
    <8f4>   DW_AT_decl_file   : 5
    <8f4>   DW_AT_decl_line   : 400
    <8f6>   DW_AT_decl_column : 17
    <8f6>   DW_AT_type        : <0x84e>
    <8fa>   DW_AT_data_member_location: 24
 <2><8fb>: Abbrev Number: 2 (DW_TAG_member)
    <8fc>   DW_AT_name        : (indirect string, offset: 0x604b9): APB1ENR
    <900>   DW_AT_decl_file   : 5
    <900>   DW_AT_decl_line   : 401
    <902>   DW_AT_decl_column : 17
    <902>   DW_AT_type        : <0x84e>
    <906>   DW_AT_data_member_location: 28
 <2><907>: Abbrev Number: 2 (DW_TAG_member)
    <908>   DW_AT_name        : (indirect string, offset: 0x11b42): BDCR
    <90c>   DW_AT_decl_file   : 5
    <90c>   DW_AT_decl_line   : 402
    <90e>   DW_AT_decl_column : 17
    <90e>   DW_AT_type        : <0x84e>
    <912>   DW_AT_data_member_location: 32
 <2><913>: Abbrev Number: 4 (DW_TAG_member)
    <914>   DW_AT_name        : CSR
    <918>   DW_AT_decl_file   : 5
    <918>   DW_AT_decl_line   : 403
    <91a>   DW_AT_decl_column : 17
    <91a>   DW_AT_type        : <0x84e>
    <91e>   DW_AT_data_member_location: 36
 <2><91f>: Abbrev Number: 2 (DW_TAG_member)
    <920>   DW_AT_name        : (indirect string, offset: 0xa995): AHBRSTR
    <924>   DW_AT_decl_file   : 5
    <924>   DW_AT_decl_line   : 404
    <926>   DW_AT_decl_column : 17
    <926>   DW_AT_type        : <0x84e>
    <92a>   DW_AT_data_member_location: 40
 <2><92b>: Abbrev Number: 2 (DW_TAG_member)
    <92c>   DW_AT_name        : (indirect string, offset: 0x4b011): CFGR2
    <930>   DW_AT_decl_file   : 5
    <930>   DW_AT_decl_line   : 405
    <932>   DW_AT_decl_column : 17
    <932>   DW_AT_type        : <0x84e>
    <936>   DW_AT_data_member_location: 44
 <2><937>: Abbrev Number: 2 (DW_TAG_member)
    <938>   DW_AT_name        : (indirect string, offset: 0x4b017): CFGR3
    <93c>   DW_AT_decl_file   : 5
    <93c>   DW_AT_decl_line   : 406
    <93e>   DW_AT_decl_column : 17
    <93e>   DW_AT_type        : <0x84e>
    <942>   DW_AT_data_member_location: 48
 <2><943>: Abbrev Number: 4 (DW_TAG_member)
    <944>   DW_AT_name        : CR2
    <948>   DW_AT_decl_file   : 5
    <948>   DW_AT_decl_line   : 407
    <94a>   DW_AT_decl_column : 17
    <94a>   DW_AT_type        : <0x84e>
    <94e>   DW_AT_data_member_location: 52
 <2><94f>: Abbrev Number: 0
 <1><950>: Abbrev Number: 15 (DW_TAG_typedef)
    <951>   DW_AT_name        : (indirect string, offset: 0x3bef1): RCC_TypeDef
    <955>   DW_AT_decl_file   : 5
    <956>   DW_AT_decl_line   : 408
    <958>   DW_AT_decl_column : 3
    <959>   DW_AT_type        : <0x89e>
 <1><95d>: Abbrev Number: 1 (DW_TAG_base_type)
    <95e>   DW_AT_byte_size   : 8
    <95f>   DW_AT_encoding    : 4	(float)
    <960>   DW_AT_name        : (indirect string, offset: 0x144dd): long double
 <1><964>: Abbrev Number: 7 (DW_TAG_variable)
    <965>   DW_AT_specification: <0x853>
    <969>   DW_AT_decl_file   : 1
    <969>   DW_AT_decl_line   : 100
    <96a>   DW_AT_decl_column : 10
    <96b>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><971>: Abbrev Number: 7 (DW_TAG_variable)
    <972>   DW_AT_specification: <0x873>
    <976>   DW_AT_decl_file   : 1
    <976>   DW_AT_decl_line   : 102
    <977>   DW_AT_decl_column : 15
    <978>   DW_AT_location    : 5 byte block: 3 0 14 0 8 	(DW_OP_addr: 8001400)
 <1><97e>: Abbrev Number: 7 (DW_TAG_variable)
    <97f>   DW_AT_specification: <0x893>
    <983>   DW_AT_decl_file   : 1
    <983>   DW_AT_decl_line   : 103
    <984>   DW_AT_decl_column : 15
    <985>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><98b>: Abbrev Number: 16 (DW_TAG_subprogram)
    <98c>   DW_AT_external    : 1
    <98c>   DW_AT_name        : (indirect string, offset: 0x7ffde): SystemCoreClockUpdate
    <990>   DW_AT_decl_file   : 1
    <991>   DW_AT_decl_line   : 178
    <992>   DW_AT_decl_column : 6
    <993>   DW_AT_prototyped  : 1
    <993>   DW_AT_low_pc      : 0
    <997>   DW_AT_high_pc     : 0x10c
    <99b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <99d>   DW_AT_call_all_tail_calls: 1
    <99d>   DW_AT_sibling     : <0x9d8>
 <2><9a1>: Abbrev Number: 17 (DW_TAG_variable)
    <9a2>   DW_AT_name        : tmp
    <9a6>   DW_AT_decl_file   : 1
    <9a7>   DW_AT_decl_line   : 180
    <9a8>   DW_AT_decl_column : 12
    <9a9>   DW_AT_type        : <0x842>
    <9ad>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><9b0>: Abbrev Number: 8 (DW_TAG_variable)
    <9b1>   DW_AT_name        : (indirect string, offset: 0x80034): pllmull
    <9b5>   DW_AT_decl_file   : 1
    <9b5>   DW_AT_decl_line   : 180
    <9b5>   DW_AT_decl_column : 21
    <9b6>   DW_AT_type        : <0x842>
    <9ba>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><9bd>: Abbrev Number: 8 (DW_TAG_variable)
    <9be>   DW_AT_name        : (indirect string, offset: 0x8001d): pllsource
    <9c2>   DW_AT_decl_file   : 1
    <9c2>   DW_AT_decl_line   : 180
    <9c2>   DW_AT_decl_column : 34
    <9c3>   DW_AT_type        : <0x842>
    <9c7>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><9ca>: Abbrev Number: 8 (DW_TAG_variable)
    <9cb>   DW_AT_name        : (indirect string, offset: 0x80027): predivfactor
    <9cf>   DW_AT_decl_file   : 1
    <9cf>   DW_AT_decl_line   : 180
    <9cf>   DW_AT_decl_column : 49
    <9d0>   DW_AT_type        : <0x842>
    <9d4>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><9d7>: Abbrev Number: 0
 <1><9d8>: Abbrev Number: 18 (DW_TAG_subprogram)
    <9d9>   DW_AT_external    : 1
    <9d9>   DW_AT_name        : (indirect string, offset: 0x8004c): SystemInit
    <9dd>   DW_AT_decl_file   : 1
    <9de>   DW_AT_decl_line   : 126
    <9df>   DW_AT_decl_column : 6
    <9e0>   DW_AT_prototyped  : 1
    <9e0>   DW_AT_low_pc      : 0x80003da
    <9e4>   DW_AT_high_pc     : 0xa
    <9e8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9ea>   DW_AT_call_all_calls: 1
 <1><9ea>: Abbrev Number: 0
  Compilation Unit @ offset 0x9eb:
   Length:        0x2c (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x43b
   Pointer Size:  4
 <0><9f7>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <9f8>   DW_AT_stmt_list   : 0x1d75
    <9fc>   DW_AT_ranges      : 0x8a
    <a00>   DW_AT_name        : (indirect string, offset: 0x80073): ../Core/Startup/startup_stm32f042k6tx.s
    <a04>   DW_AT_comp_dir    : (indirect string, offset: 0x1a017): C:/Users/andre/Desktop/E2A S2/Progeto_di_semestre/3_Design/FW/Debug
    <a08>   DW_AT_producer    : (indirect string, offset: 0x8009b): GNU AS 2.42.0
    <a0c>   DW_AT_language    : 32769	(MIPS assembler)
 <1><a0e>: Abbrev Number: 2 (DW_TAG_subprogram)
    <a0f>   DW_AT_name        : (indirect string, offset: 0x800a9): Reset_Handler
    <a13>   DW_AT_type        : <0xa19>
    <a14>   DW_AT_low_pc      : 0x80003e5
    <a18>   DW_AT_high_pc     : 80
 <1><a19>: Abbrev Number: 3 (DW_TAG_unspecified_type)
 <1><a1a>: Abbrev Number: 0
  Compilation Unit @ offset 0xa1b:
   Length:        0x699 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x45f
   Pointer Size:  4
 <0><a27>: Abbrev Number: 20 (DW_TAG_compile_unit)
    <a28>   DW_AT_producer    : (indirect string, offset: 0x3958d): GNU C11 13.3.1 20240614 -mcpu=cortex-m0 -mfloat-abi=soft -mthumb -march=armv6s-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <a2c>   DW_AT_language    : 29	(C11)
    <a2d>   DW_AT_name        : (indirect string, offset: 0x80399): ../Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal.c
    <a31>   DW_AT_comp_dir    : (indirect string, offset: 0x1a017): C:/Users/andre/Desktop/E2A S2/Progeto_di_semestre/3_Design/FW/Debug
    <a35>   DW_AT_ranges      : 0xa4
    <a39>   DW_AT_low_pc      : 0
    <a3d>   DW_AT_stmt_list   : 0x1e02
    <a41>   DW_AT_macros      : 0x161d2
 <1><a45>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <a46>   DW_AT_encoding    : 5	(signed)
    <a47>   DW_AT_byte_size   : 1
    <a47>   DW_AT_type        : <0xb12>
    <a4b>   DW_AT_decl_file   : 2
    <a4c>   DW_AT_decl_line   : 67
    <a4d>   DW_AT_decl_column : 1
    <a4d>   DW_AT_sibling     : <0xb12>
 <2><a51>: Abbrev Number: 8 (DW_TAG_enumerator)
    <a52>   DW_AT_name        : (indirect string, offset: 0x80142): NonMaskableInt_IRQn
    <a56>   DW_AT_const_value : -14
 <2><a57>: Abbrev Number: 8 (DW_TAG_enumerator)
    <a58>   DW_AT_name        : (indirect string, offset: 0x80112): HardFault_IRQn
    <a5c>   DW_AT_const_value : -13
 <2><a5d>: Abbrev Number: 8 (DW_TAG_enumerator)
    <a5e>   DW_AT_name        : (indirect string, offset: 0x2ef5d): SVCall_IRQn
    <a62>   DW_AT_const_value : -5
 <2><a63>: Abbrev Number: 8 (DW_TAG_enumerator)
    <a64>   DW_AT_name        : (indirect string, offset: 0x802ff): PendSV_IRQn
    <a68>   DW_AT_const_value : -2
 <2><a69>: Abbrev Number: 8 (DW_TAG_enumerator)
    <a6a>   DW_AT_name        : (indirect string, offset: 0x80556): SysTick_IRQn
    <a6e>   DW_AT_const_value : -1
 <2><a6f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a70>   DW_AT_name        : (indirect string, offset: 0x8038f): WWDG_IRQn
    <a74>   DW_AT_const_value : 0
 <2><a75>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a76>   DW_AT_name        : (indirect string, offset: 0x7abd1): PVD_VDDIO2_IRQn
    <a7a>   DW_AT_const_value : 1
 <2><a7b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x802cb): RTC_IRQn
    <a80>   DW_AT_const_value : 2
 <2><a81>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a82>   DW_AT_name        : (indirect string, offset: 0x80196): FLASH_IRQn
    <a86>   DW_AT_const_value : 3
 <2><a87>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a88>   DW_AT_name        : (indirect string, offset: 0x773b1): RCC_CRS_IRQn
    <a8c>   DW_AT_const_value : 4
 <2><a8d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a8e>   DW_AT_name        : (indirect string, offset: 0x8029e): EXTI0_1_IRQn
    <a92>   DW_AT_const_value : 5
 <2><a93>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a94>   DW_AT_name        : (indirect string, offset: 0x801cc): EXTI2_3_IRQn
    <a98>   DW_AT_const_value : 6
 <2><a99>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x80349): EXTI4_15_IRQn
    <a9e>   DW_AT_const_value : 7
 <2><a9f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x8028b): TSC_IRQn
    <aa4>   DW_AT_const_value : 8
 <2><aa5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x4a79e): DMA1_Channel1_IRQn
    <aaa>   DW_AT_const_value : 9
 <2><aab>: Abbrev Number: 1 (DW_TAG_enumerator)
    <aac>   DW_AT_name        : (indirect string, offset: 0x51d71): DMA1_Channel2_3_IRQn
    <ab0>   DW_AT_const_value : 10
 <2><ab1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ab2>   DW_AT_name        : (indirect string, offset: 0x7e782): DMA1_Channel4_5_IRQn
    <ab6>   DW_AT_const_value : 11
 <2><ab7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ab8>   DW_AT_name        : (indirect string, offset: 0xe76): ADC1_IRQn
    <abc>   DW_AT_const_value : 12
 <2><abd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <abe>   DW_AT_name        : (indirect string, offset: 0x8025e): TIM1_BRK_UP_TRG_COM_IRQn
    <ac2>   DW_AT_const_value : 13
 <2><ac3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ac4>   DW_AT_name        : (indirect string, offset: 0x802ab): TIM1_CC_IRQn
    <ac8>   DW_AT_const_value : 14
 <2><ac9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <aca>   DW_AT_name        : (indirect string, offset: 0x8012b): TIM2_IRQn
    <ace>   DW_AT_const_value : 15
 <2><acf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ad0>   DW_AT_name        : (indirect string, offset: 0x8031a): TIM3_IRQn
    <ad4>   DW_AT_const_value : 16
 <2><ad5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ad6>   DW_AT_name        : (indirect string, offset: 0x8023d): TIM14_IRQn
    <ada>   DW_AT_const_value : 19
 <2><adb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <adc>   DW_AT_name        : (indirect string, offset: 0x801c1): TIM16_IRQn
    <ae0>   DW_AT_const_value : 21
 <2><ae1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x8049e): TIM17_IRQn
    <ae6>   DW_AT_const_value : 22
 <2><ae7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ae8>   DW_AT_name        : (indirect string, offset: 0x80294): I2C1_IRQn
    <aec>   DW_AT_const_value : 23
 <2><aed>: Abbrev Number: 1 (DW_TAG_enumerator)
    <aee>   DW_AT_name        : (indirect string, offset: 0x80121): SPI1_IRQn
    <af2>   DW_AT_const_value : 25
 <2><af3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af4>   DW_AT_name        : (indirect string, offset: 0x80310): SPI2_IRQn
    <af8>   DW_AT_const_value : 26
 <2><af9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <afa>   DW_AT_name        : (indirect string, offset: 0x804b9): USART1_IRQn
    <afe>   DW_AT_const_value : 27
 <2><aff>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b00>   DW_AT_name        : (indirect string, offset: 0x801ae): USART2_IRQn
    <b04>   DW_AT_const_value : 28
 <2><b05>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b06>   DW_AT_name        : (indirect string, offset: 0x804de): CEC_CAN_IRQn
    <b0a>   DW_AT_const_value : 30
 <2><b0b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x8054d): USB_IRQn
    <b10>   DW_AT_const_value : 31
 <2><b11>: Abbrev Number: 0
 <1><b12>: Abbrev Number: 3 (DW_TAG_base_type)
    <b13>   DW_AT_byte_size   : 1
    <b14>   DW_AT_encoding    : 6	(signed char)
    <b15>   DW_AT_name        : (indirect string, offset: 0x4072a): signed char
 <1><b19>: Abbrev Number: 7 (DW_TAG_typedef)
    <b1a>   DW_AT_name        : (indirect string, offset: 0x8052c): IRQn_Type
    <b1e>   DW_AT_decl_file   : 2
    <b1f>   DW_AT_decl_line   : 103
    <b20>   DW_AT_decl_column : 3
    <b21>   DW_AT_type        : <0xa45>
 <1><b25>: Abbrev Number: 3 (DW_TAG_base_type)
    <b26>   DW_AT_byte_size   : 1
    <b27>   DW_AT_encoding    : 8	(unsigned char)
    <b28>   DW_AT_name        : (indirect string, offset: 0x5c9c8): unsigned char
 <1><b2c>: Abbrev Number: 3 (DW_TAG_base_type)
    <b2d>   DW_AT_byte_size   : 2
    <b2e>   DW_AT_encoding    : 5	(signed)
    <b2f>   DW_AT_name        : (indirect string, offset: 0x5f2bc): short int
 <1><b33>: Abbrev Number: 3 (DW_TAG_base_type)
    <b34>   DW_AT_byte_size   : 2
    <b35>   DW_AT_encoding    : 7	(unsigned)
    <b36>   DW_AT_name        : (indirect string, offset: 0x7a239): short unsigned int
 <1><b3a>: Abbrev Number: 3 (DW_TAG_base_type)
    <b3b>   DW_AT_byte_size   : 4
    <b3c>   DW_AT_encoding    : 5	(signed)
    <b3d>   DW_AT_name        : (indirect string, offset: 0xb0b0): long int
 <1><b41>: Abbrev Number: 7 (DW_TAG_typedef)
    <b42>   DW_AT_name        : (indirect string, offset: 0x5166f): __uint32_t
    <b46>   DW_AT_decl_file   : 3
    <b47>   DW_AT_decl_line   : 79
    <b48>   DW_AT_decl_column : 25
    <b49>   DW_AT_type        : <0xb4d>
 <1><b4d>: Abbrev Number: 3 (DW_TAG_base_type)
    <b4e>   DW_AT_byte_size   : 4
    <b4f>   DW_AT_encoding    : 7	(unsigned)
    <b50>   DW_AT_name        : (indirect string, offset: 0x440c0): long unsigned int
 <1><b54>: Abbrev Number: 3 (DW_TAG_base_type)
    <b55>   DW_AT_byte_size   : 8
    <b56>   DW_AT_encoding    : 5	(signed)
    <b57>   DW_AT_name        : (indirect string, offset: 0x3ad4b): long long int
 <1><b5b>: Abbrev Number: 3 (DW_TAG_base_type)
    <b5c>   DW_AT_byte_size   : 8
    <b5d>   DW_AT_encoding    : 7	(unsigned)
    <b5e>   DW_AT_name        : (indirect string, offset: 0x1a7f2): long long unsigned int
 <1><b62>: Abbrev Number: 21 (DW_TAG_base_type)
    <b63>   DW_AT_byte_size   : 4
    <b64>   DW_AT_encoding    : 5	(signed)
    <b65>   DW_AT_name        : int
 <1><b69>: Abbrev Number: 3 (DW_TAG_base_type)
    <b6a>   DW_AT_byte_size   : 4
    <b6b>   DW_AT_encoding    : 7	(unsigned)
    <b6c>   DW_AT_name        : (indirect string, offset: 0xaaa9): unsigned int
 <1><b70>: Abbrev Number: 7 (DW_TAG_typedef)
    <b71>   DW_AT_name        : (indirect string, offset: 0x51671): uint32_t
    <b75>   DW_AT_decl_file   : 4
    <b76>   DW_AT_decl_line   : 48
    <b77>   DW_AT_decl_column : 20
    <b78>   DW_AT_type        : <0xb41>
 <1><b7c>: Abbrev Number: 22 (DW_TAG_volatile_type)
    <b7d>   DW_AT_type        : <0xb70>
 <1><b81>: Abbrev Number: 23 (DW_TAG_const_type)
    <b82>   DW_AT_type        : <0xb7c>
 <1><b86>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b87>   DW_AT_byte_size   : 16
    <b88>   DW_AT_decl_file   : 5
    <b89>   DW_AT_decl_line   : 448
    <b8b>   DW_AT_decl_column : 9
    <b8b>   DW_AT_sibling     : <0xbc8>
 <2><b8f>: Abbrev Number: 2 (DW_TAG_member)
    <b90>   DW_AT_name        : (indirect string, offset: 0x8030b): CTRL
    <b94>   DW_AT_decl_file   : 5
    <b95>   DW_AT_decl_line   : 450
    <b97>   DW_AT_decl_column : 18
    <b98>   DW_AT_type        : <0xb7c>
    <b9c>   DW_AT_data_member_location: 0
 <2><b9d>: Abbrev Number: 2 (DW_TAG_member)
    <b9e>   DW_AT_name        : (indirect string, offset: 0x46b9a): LOAD
    <ba2>   DW_AT_decl_file   : 5
    <ba3>   DW_AT_decl_line   : 451
    <ba5>   DW_AT_decl_column : 18
    <ba6>   DW_AT_type        : <0xb7c>
    <baa>   DW_AT_data_member_location: 4
 <2><bab>: Abbrev Number: 4 (DW_TAG_member)
    <bac>   DW_AT_name        : VAL
    <bb0>   DW_AT_decl_file   : 5
    <bb1>   DW_AT_decl_line   : 452
    <bb3>   DW_AT_decl_column : 18
    <bb4>   DW_AT_type        : <0xb7c>
    <bb8>   DW_AT_data_member_location: 8
 <2><bb9>: Abbrev Number: 2 (DW_TAG_member)
    <bba>   DW_AT_name        : (indirect string, offset: 0x80200): CALIB
    <bbe>   DW_AT_decl_file   : 5
    <bbf>   DW_AT_decl_line   : 453
    <bc1>   DW_AT_decl_column : 18
    <bc2>   DW_AT_type        : <0xb81>
    <bc6>   DW_AT_data_member_location: 12
 <2><bc7>: Abbrev Number: 0
 <1><bc8>: Abbrev Number: 13 (DW_TAG_typedef)
    <bc9>   DW_AT_name        : (indirect string, offset: 0x801a1): SysTick_Type
    <bcd>   DW_AT_decl_file   : 5
    <bce>   DW_AT_decl_line   : 454
    <bd0>   DW_AT_decl_column : 3
    <bd0>   DW_AT_type        : <0xb86>
 <1><bd4>: Abbrev Number: 24 (DW_TAG_variable)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x8003c): SystemCoreClock
    <bd9>   DW_AT_decl_file   : 8
    <bda>   DW_AT_decl_line   : 56
    <bdb>   DW_AT_decl_column : 17
    <bdc>   DW_AT_type        : <0xb70>
    <be0>   DW_AT_external    : 1
    <be0>   DW_AT_declaration : 1
 <1><be0>: Abbrev Number: 25 (DW_TAG_structure_type)
    <be1>   DW_AT_byte_size   : 16
    <be2>   DW_AT_decl_file   : 2
    <be3>   DW_AT_decl_line   : 248
    <be4>   DW_AT_decl_column : 9
    <be5>   DW_AT_sibling     : <0xc17>
 <2><be9>: Abbrev Number: 14 (DW_TAG_member)
    <bea>   DW_AT_name        : (indirect string, offset: 0x80525): IDCODE
    <bee>   DW_AT_decl_file   : 2
    <bee>   DW_AT_decl_line   : 250
    <bef>   DW_AT_decl_column : 17
    <bef>   DW_AT_type        : <0xb7c>
    <bf3>   DW_AT_data_member_location: 0
 <2><bf4>: Abbrev Number: 26 (DW_TAG_member)
    <bf5>   DW_AT_name        : CR
    <bf8>   DW_AT_decl_file   : 2
    <bf9>   DW_AT_decl_line   : 251
    <bfa>   DW_AT_decl_column : 17
    <bfb>   DW_AT_type        : <0xb7c>
    <bff>   DW_AT_data_member_location: 4
 <2><c00>: Abbrev Number: 14 (DW_TAG_member)
    <c01>   DW_AT_name        : (indirect string, offset: 0x80536): APB1FZ
    <c05>   DW_AT_decl_file   : 2
    <c05>   DW_AT_decl_line   : 252
    <c06>   DW_AT_decl_column : 17
    <c06>   DW_AT_type        : <0xb7c>
    <c0a>   DW_AT_data_member_location: 8
 <2><c0b>: Abbrev Number: 14 (DW_TAG_member)
    <c0c>   DW_AT_name        : (indirect string, offset: 0x800dc): APB2FZ
    <c10>   DW_AT_decl_file   : 2
    <c10>   DW_AT_decl_line   : 253
    <c11>   DW_AT_decl_column : 17
    <c11>   DW_AT_type        : <0xb7c>
    <c15>   DW_AT_data_member_location: 12
 <2><c16>: Abbrev Number: 0
 <1><c17>: Abbrev Number: 7 (DW_TAG_typedef)
    <c18>   DW_AT_name        : (indirect string, offset: 0x801f1): DBGMCU_TypeDef
    <c1c>   DW_AT_decl_file   : 2
    <c1d>   DW_AT_decl_line   : 254
    <c1e>   DW_AT_decl_column : 2
    <c1f>   DW_AT_type        : <0xbe0>
 <1><c23>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c24>   DW_AT_byte_size   : 36
    <c25>   DW_AT_decl_file   : 2
    <c26>   DW_AT_decl_line   : 291
    <c28>   DW_AT_decl_column : 9
    <c28>   DW_AT_sibling     : <0xca8>
 <2><c2c>: Abbrev Number: 4 (DW_TAG_member)
    <c2d>   DW_AT_name        : ACR
    <c31>   DW_AT_decl_file   : 2
    <c32>   DW_AT_decl_line   : 293
    <c34>   DW_AT_decl_column : 17
    <c35>   DW_AT_type        : <0xb7c>
    <c39>   DW_AT_data_member_location: 0
 <2><c3a>: Abbrev Number: 2 (DW_TAG_member)
    <c3b>   DW_AT_name        : (indirect string, offset: 0x801dc): KEYR
    <c3f>   DW_AT_decl_file   : 2
    <c40>   DW_AT_decl_line   : 294
    <c42>   DW_AT_decl_column : 17
    <c43>   DW_AT_type        : <0xb7c>
    <c47>   DW_AT_data_member_location: 4
 <2><c48>: Abbrev Number: 2 (DW_TAG_member)
    <c49>   DW_AT_name        : (indirect string, offset: 0x801d9): OPTKEYR
    <c4d>   DW_AT_decl_file   : 2
    <c4e>   DW_AT_decl_line   : 295
    <c50>   DW_AT_decl_column : 17
    <c51>   DW_AT_type        : <0xb7c>
    <c55>   DW_AT_data_member_location: 8
 <2><c56>: Abbrev Number: 4 (DW_TAG_member)
    <c57>   DW_AT_name        : SR
    <c5a>   DW_AT_decl_file   : 2
    <c5b>   DW_AT_decl_line   : 296
    <c5d>   DW_AT_decl_column : 17
    <c5e>   DW_AT_type        : <0xb7c>
    <c62>   DW_AT_data_member_location: 12
 <2><c63>: Abbrev Number: 4 (DW_TAG_member)
    <c64>   DW_AT_name        : CR
    <c67>   DW_AT_decl_file   : 2
    <c68>   DW_AT_decl_line   : 297
    <c6a>   DW_AT_decl_column : 17
    <c6b>   DW_AT_type        : <0xb7c>
    <c6f>   DW_AT_data_member_location: 16
 <2><c70>: Abbrev Number: 4 (DW_TAG_member)
    <c71>   DW_AT_name        : AR
    <c74>   DW_AT_decl_file   : 2
    <c75>   DW_AT_decl_line   : 298
    <c77>   DW_AT_decl_column : 17
    <c78>   DW_AT_type        : <0xb7c>
    <c7c>   DW_AT_data_member_location: 20
 <2><c7d>: Abbrev Number: 2 (DW_TAG_member)
    <c7e>   DW_AT_name        : (indirect string, offset: 0x4d0e2): RESERVED
    <c82>   DW_AT_decl_file   : 2
    <c83>   DW_AT_decl_line   : 299
    <c85>   DW_AT_decl_column : 17
    <c86>   DW_AT_type        : <0xb7c>
    <c8a>   DW_AT_data_member_location: 24
 <2><c8b>: Abbrev Number: 4 (DW_TAG_member)
    <c8c>   DW_AT_name        : OBR
    <c90>   DW_AT_decl_file   : 2
    <c91>   DW_AT_decl_line   : 300
    <c93>   DW_AT_decl_column : 17
    <c94>   DW_AT_type        : <0xb7c>
    <c98>   DW_AT_data_member_location: 28
 <2><c99>: Abbrev Number: 2 (DW_TAG_member)
    <c9a>   DW_AT_name        : (indirect string, offset: 0x80548): WRPR
    <c9e>   DW_AT_decl_file   : 2
    <c9f>   DW_AT_decl_line   : 301
    <ca1>   DW_AT_decl_column : 17
    <ca2>   DW_AT_type        : <0xb7c>
    <ca6>   DW_AT_data_member_location: 32
 <2><ca7>: Abbrev Number: 0
 <1><ca8>: Abbrev Number: 13 (DW_TAG_typedef)
    <ca9>   DW_AT_name        : (indirect string, offset: 0x80381): FLASH_TypeDef
    <cad>   DW_AT_decl_file   : 2
    <cae>   DW_AT_decl_line   : 302
    <cb0>   DW_AT_decl_column : 3
    <cb0>   DW_AT_type        : <0xc23>
 <1><cb4>: Abbrev Number: 12 (DW_TAG_structure_type)
    <cb5>   DW_AT_byte_size   : 56
    <cb6>   DW_AT_decl_file   : 2
    <cb7>   DW_AT_decl_line   : 392
    <cb9>   DW_AT_decl_column : 9
    <cb9>   DW_AT_sibling     : <0xd81>
 <2><cbd>: Abbrev Number: 4 (DW_TAG_member)
    <cbe>   DW_AT_name        : CR
    <cc1>   DW_AT_decl_file   : 2
    <cc2>   DW_AT_decl_line   : 394
    <cc4>   DW_AT_decl_column : 17
    <cc5>   DW_AT_type        : <0xb7c>
    <cc9>   DW_AT_data_member_location: 0
 <2><cca>: Abbrev Number: 2 (DW_TAG_member)
    <ccb>   DW_AT_name        : (indirect string, offset: 0x4d467): CFGR
    <ccf>   DW_AT_decl_file   : 2
    <cd0>   DW_AT_decl_line   : 395
    <cd2>   DW_AT_decl_column : 17
    <cd3>   DW_AT_type        : <0xb7c>
    <cd7>   DW_AT_data_member_location: 4
 <2><cd8>: Abbrev Number: 4 (DW_TAG_member)
    <cd9>   DW_AT_name        : CIR
    <cdd>   DW_AT_decl_file   : 2
    <cde>   DW_AT_decl_line   : 396
    <ce0>   DW_AT_decl_column : 17
    <ce1>   DW_AT_type        : <0xb7c>
    <ce5>   DW_AT_data_member_location: 8
 <2><ce6>: Abbrev Number: 2 (DW_TAG_member)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x37e96): APB2RSTR
    <ceb>   DW_AT_decl_file   : 2
    <cec>   DW_AT_decl_line   : 397
    <cee>   DW_AT_decl_column : 17
    <cef>   DW_AT_type        : <0xb7c>
    <cf3>   DW_AT_data_member_location: 12
 <2><cf4>: Abbrev Number: 2 (DW_TAG_member)
    <cf5>   DW_AT_name        : (indirect string, offset: 0xe84d): APB1RSTR
    <cf9>   DW_AT_decl_file   : 2
    <cfa>   DW_AT_decl_line   : 398
    <cfc>   DW_AT_decl_column : 17
    <cfd>   DW_AT_type        : <0xb7c>
    <d01>   DW_AT_data_member_location: 16
 <2><d02>: Abbrev Number: 2 (DW_TAG_member)
    <d03>   DW_AT_name        : (indirect string, offset: 0xbeae): AHBENR
    <d07>   DW_AT_decl_file   : 2
    <d08>   DW_AT_decl_line   : 399
    <d0a>   DW_AT_decl_column : 17
    <d0b>   DW_AT_type        : <0xb7c>
    <d0f>   DW_AT_data_member_location: 20
 <2><d10>: Abbrev Number: 2 (DW_TAG_member)
    <d11>   DW_AT_name        : (indirect string, offset: 0xf1b6): APB2ENR
    <d15>   DW_AT_decl_file   : 2
    <d16>   DW_AT_decl_line   : 400
    <d18>   DW_AT_decl_column : 17
    <d19>   DW_AT_type        : <0xb7c>
    <d1d>   DW_AT_data_member_location: 24
 <2><d1e>: Abbrev Number: 2 (DW_TAG_member)
    <d1f>   DW_AT_name        : (indirect string, offset: 0x604b9): APB1ENR
    <d23>   DW_AT_decl_file   : 2
    <d24>   DW_AT_decl_line   : 401
    <d26>   DW_AT_decl_column : 17
    <d27>   DW_AT_type        : <0xb7c>
    <d2b>   DW_AT_data_member_location: 28
 <2><d2c>: Abbrev Number: 2 (DW_TAG_member)
    <d2d>   DW_AT_name        : (indirect string, offset: 0x11b42): BDCR
    <d31>   DW_AT_decl_file   : 2
    <d32>   DW_AT_decl_line   : 402
    <d34>   DW_AT_decl_column : 17
    <d35>   DW_AT_type        : <0xb7c>
    <d39>   DW_AT_data_member_location: 32
 <2><d3a>: Abbrev Number: 4 (DW_TAG_member)
    <d3b>   DW_AT_name        : CSR
    <d3f>   DW_AT_decl_file   : 2
    <d40>   DW_AT_decl_line   : 403
    <d42>   DW_AT_decl_column : 17
    <d43>   DW_AT_type        : <0xb7c>
    <d47>   DW_AT_data_member_location: 36
 <2><d48>: Abbrev Number: 2 (DW_TAG_member)
    <d49>   DW_AT_name        : (indirect string, offset: 0xa995): AHBRSTR
    <d4d>   DW_AT_decl_file   : 2
    <d4e>   DW_AT_decl_line   : 404
    <d50>   DW_AT_decl_column : 17
    <d51>   DW_AT_type        : <0xb7c>
    <d55>   DW_AT_data_member_location: 40
 <2><d56>: Abbrev Number: 2 (DW_TAG_member)
    <d57>   DW_AT_name        : (indirect string, offset: 0x4b011): CFGR2
    <d5b>   DW_AT_decl_file   : 2
    <d5c>   DW_AT_decl_line   : 405
    <d5e>   DW_AT_decl_column : 17
    <d5f>   DW_AT_type        : <0xb7c>
    <d63>   DW_AT_data_member_location: 44
 <2><d64>: Abbrev Number: 2 (DW_TAG_member)
    <d65>   DW_AT_name        : (indirect string, offset: 0x4b017): CFGR3
    <d69>   DW_AT_decl_file   : 2
    <d6a>   DW_AT_decl_line   : 406
    <d6c>   DW_AT_decl_column : 17
    <d6d>   DW_AT_type        : <0xb7c>
    <d71>   DW_AT_data_member_location: 48
 <2><d72>: Abbrev Number: 4 (DW_TAG_member)
    <d73>   DW_AT_name        : CR2
    <d77>   DW_AT_decl_file   : 2
    <d78>   DW_AT_decl_line   : 407
    <d7a>   DW_AT_decl_column : 17
    <d7b>   DW_AT_type        : <0xb7c>
    <d7f>   DW_AT_data_member_location: 52
 <2><d80>: Abbrev Number: 0
 <1><d81>: Abbrev Number: 13 (DW_TAG_typedef)
    <d82>   DW_AT_name        : (indirect string, offset: 0x3bef1): RCC_TypeDef
    <d86>   DW_AT_decl_file   : 2
    <d87>   DW_AT_decl_line   : 408
    <d89>   DW_AT_decl_column : 3
    <d89>   DW_AT_type        : <0xcb4>
 <1><d8d>: Abbrev Number: 3 (DW_TAG_base_type)
    <d8e>   DW_AT_byte_size   : 8
    <d8f>   DW_AT_encoding    : 4	(float)
    <d90>   DW_AT_name        : (indirect string, offset: 0x144dd): long double
 <1><d94>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <d95>   DW_AT_encoding    : 7	(unsigned)
    <d96>   DW_AT_byte_size   : 1
    <d96>   DW_AT_type        : <0xb25>
    <d9a>   DW_AT_decl_file   : 6
    <d9b>   DW_AT_decl_line   : 39
    <d9c>   DW_AT_decl_column : 1
    <d9c>   DW_AT_sibling     : <0xdb9>
 <2><da0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <da1>   DW_AT_name        : (indirect string, offset: 0x2b462): HAL_OK
    <da5>   DW_AT_const_value : 0
 <2><da6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <da7>   DW_AT_name        : (indirect string, offset: 0x4fde3): HAL_ERROR
    <dab>   DW_AT_const_value : 1
 <2><dac>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dad>   DW_AT_name        : (indirect string, offset: 0x1648e): HAL_BUSY
    <db1>   DW_AT_const_value : 2
 <2><db2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <db3>   DW_AT_name        : (indirect string, offset: 0x2581d): HAL_TIMEOUT
    <db7>   DW_AT_const_value : 3
 <2><db8>: Abbrev Number: 0
 <1><db9>: Abbrev Number: 7 (DW_TAG_typedef)
    <dba>   DW_AT_name        : (indirect string, offset: 0x16e8): HAL_StatusTypeDef
    <dbe>   DW_AT_decl_file   : 6
    <dbf>   DW_AT_decl_line   : 44
    <dc0>   DW_AT_decl_column : 3
    <dc1>   DW_AT_type        : <0xd94>
 <1><dc5>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <dc6>   DW_AT_encoding    : 7	(unsigned)
    <dc7>   DW_AT_byte_size   : 1
    <dc7>   DW_AT_type        : <0xb25>
    <dcb>   DW_AT_decl_file   : 7
    <dcc>   DW_AT_decl_line   : 80
    <dcd>   DW_AT_decl_column : 1
    <dcd>   DW_AT_sibling     : <0xdea>
 <2><dd1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dd2>   DW_AT_name        : (indirect string, offset: 0x802d4): HAL_TICK_FREQ_10HZ
    <dd6>   DW_AT_const_value : 100
 <2><dd7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dd8>   DW_AT_name        : (indirect string, offset: 0x80277): HAL_TICK_FREQ_100HZ
    <ddc>   DW_AT_const_value : 10
 <2><ddd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dde>   DW_AT_name        : (indirect string, offset: 0x802b8): HAL_TICK_FREQ_1KHZ
    <de2>   DW_AT_const_value : 1
 <2><de3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <de4>   DW_AT_name        : (indirect string, offset: 0x80248): HAL_TICK_FREQ_DEFAULT
    <de8>   DW_AT_const_value : 1
 <2><de9>: Abbrev Number: 0
 <1><dea>: Abbrev Number: 7 (DW_TAG_typedef)
    <deb>   DW_AT_name        : (indirect string, offset: 0x804c5): HAL_TickFreqTypeDef
    <def>   DW_AT_decl_file   : 7
    <df0>   DW_AT_decl_line   : 85
    <df1>   DW_AT_decl_column : 3
    <df2>   DW_AT_type        : <0xdc5>
 <1><df6>: Abbrev Number: 15 (DW_TAG_variable)
    <df7>   DW_AT_name        : (indirect string, offset: 0x801ba): uwTick
    <dfb>   DW_AT_decl_file   : 7
    <dfb>   DW_AT_decl_line   : 532
    <dfd>   DW_AT_decl_column : 22
    <dfe>   DW_AT_type        : <0xb7c>
    <e02>   DW_AT_external    : 1
    <e02>   DW_AT_declaration : 1
 <1><e02>: Abbrev Number: 15 (DW_TAG_variable)
    <e03>   DW_AT_name        : (indirect string, offset: 0x80369): uwTickPrio
    <e07>   DW_AT_decl_file   : 7
    <e07>   DW_AT_decl_line   : 533
    <e09>   DW_AT_decl_column : 17
    <e0a>   DW_AT_type        : <0xb70>
    <e0e>   DW_AT_external    : 1
    <e0e>   DW_AT_declaration : 1
 <1><e0e>: Abbrev Number: 15 (DW_TAG_variable)
    <e0f>   DW_AT_name        : (indirect string, offset: 0x8053d): uwTickFreq
    <e13>   DW_AT_decl_file   : 7
    <e13>   DW_AT_decl_line   : 534
    <e15>   DW_AT_decl_column : 28
    <e16>   DW_AT_type        : <0xdea>
    <e1a>   DW_AT_external    : 1
    <e1a>   DW_AT_declaration : 1
 <1><e1a>: Abbrev Number: 16 (DW_TAG_variable)
    <e1b>   DW_AT_specification: <0xdf6>
    <e1f>   DW_AT_decl_file   : 1
    <e1f>   DW_AT_decl_line   : 83
    <e20>   DW_AT_decl_column : 15
    <e21>   DW_AT_location    : 5 byte block: 3 28 0 0 20 	(DW_OP_addr: 20000028)
 <1><e27>: Abbrev Number: 16 (DW_TAG_variable)
    <e28>   DW_AT_specification: <0xe02>
    <e2c>   DW_AT_decl_file   : 1
    <e2c>   DW_AT_decl_line   : 84
    <e2d>   DW_AT_decl_column : 10
    <e2e>   DW_AT_location    : 5 byte block: 3 4 0 0 20 	(DW_OP_addr: 20000004)
 <1><e34>: Abbrev Number: 16 (DW_TAG_variable)
    <e35>   DW_AT_specification: <0xe0e>
    <e39>   DW_AT_decl_file   : 1
    <e39>   DW_AT_decl_line   : 85
    <e3a>   DW_AT_decl_column : 21
    <e3b>   DW_AT_location    : 5 byte block: 3 8 0 0 20 	(DW_OP_addr: 20000008)
 <1><e41>: Abbrev Number: 27 (DW_TAG_subprogram)
    <e42>   DW_AT_external    : 1
    <e42>   DW_AT_name        : (indirect string, offset: 0x804eb): HAL_NVIC_SetPriority
    <e46>   DW_AT_decl_file   : 9
    <e47>   DW_AT_decl_line   : 69
    <e48>   DW_AT_decl_column : 6
    <e49>   DW_AT_prototyped  : 1
    <e49>   DW_AT_declaration : 1
    <e49>   DW_AT_sibling     : <0xe5d>
 <2><e4d>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <e4e>   DW_AT_type        : <0xb19>
 <2><e52>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <e53>   DW_AT_type        : <0xb70>
 <2><e57>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <e58>   DW_AT_type        : <0xb70>
 <2><e5c>: Abbrev Number: 0
 <1><e5d>: Abbrev Number: 28 (DW_TAG_subprogram)
    <e5e>   DW_AT_external    : 1
    <e5e>   DW_AT_name        : (indirect string, offset: 0x80563): HAL_SYSTICK_Config
    <e62>   DW_AT_decl_file   : 9
    <e63>   DW_AT_decl_line   : 73
    <e64>   DW_AT_decl_column : 10
    <e65>   DW_AT_prototyped  : 1
    <e65>   DW_AT_type        : <0xb70>
    <e69>   DW_AT_declaration : 1
    <e69>   DW_AT_sibling     : <0xe73>
 <2><e6d>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <e6e>   DW_AT_type        : <0xb70>
 <2><e72>: Abbrev Number: 0
 <1><e73>: Abbrev Number: 6 (DW_TAG_subprogram)
    <e74>   DW_AT_external    : 1
    <e74>   DW_AT_name        : (indirect string, offset: 0x598a1): HAL_DBGMCU_DisableDBGStandbyMode
    <e78>   DW_AT_decl_file   : 1
    <e78>   DW_AT_decl_line   : 493
    <e7a>   DW_AT_decl_column : 6
    <e7b>   DW_AT_prototyped  : 1
    <e7b>   DW_AT_low_pc      : 0
    <e7f>   DW_AT_high_pc     : 0x1c
    <e83>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e85>   DW_AT_call_all_calls: 1
 <1><e85>: Abbrev Number: 6 (DW_TAG_subprogram)
    <e86>   DW_AT_external    : 1
    <e86>   DW_AT_name        : (indirect string, offset: 0x6a319): HAL_DBGMCU_EnableDBGStandbyMode
    <e8a>   DW_AT_decl_file   : 1
    <e8a>   DW_AT_decl_line   : 484
    <e8c>   DW_AT_decl_column : 6
    <e8d>   DW_AT_prototyped  : 1
    <e8d>   DW_AT_low_pc      : 0
    <e91>   DW_AT_high_pc     : 0x1c
    <e95>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e97>   DW_AT_call_all_calls: 1
 <1><e97>: Abbrev Number: 6 (DW_TAG_subprogram)
    <e98>   DW_AT_external    : 1
    <e98>   DW_AT_name        : (indirect string, offset: 0x53781): HAL_DBGMCU_DisableDBGStopMode
    <e9c>   DW_AT_decl_file   : 1
    <e9c>   DW_AT_decl_line   : 475
    <e9e>   DW_AT_decl_column : 6
    <e9f>   DW_AT_prototyped  : 1
    <e9f>   DW_AT_low_pc      : 0
    <ea3>   DW_AT_high_pc     : 0x1c
    <ea7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ea9>   DW_AT_call_all_calls: 1
 <1><ea9>: Abbrev Number: 6 (DW_TAG_subprogram)
    <eaa>   DW_AT_external    : 1
    <eaa>   DW_AT_name        : (indirect string, offset: 0xab27): HAL_DBGMCU_EnableDBGStopMode
    <eae>   DW_AT_decl_file   : 1
    <eae>   DW_AT_decl_line   : 466
    <eb0>   DW_AT_decl_column : 6
    <eb1>   DW_AT_prototyped  : 1
    <eb1>   DW_AT_low_pc      : 0
    <eb5>   DW_AT_high_pc     : 0x1c
    <eb9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ebb>   DW_AT_call_all_calls: 1
 <1><ebb>: Abbrev Number: 5 (DW_TAG_subprogram)
    <ebc>   DW_AT_external    : 1
    <ebc>   DW_AT_name        : (indirect string, offset: 0x80220): HAL_GetUIDw2
    <ec0>   DW_AT_decl_file   : 1
    <ec0>   DW_AT_decl_line   : 457
    <ec2>   DW_AT_decl_column : 10
    <ec3>   DW_AT_prototyped  : 1
    <ec3>   DW_AT_type        : <0xb70>
    <ec7>   DW_AT_low_pc      : 0
    <ecb>   DW_AT_high_pc     : 0x14
    <ecf>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ed1>   DW_AT_call_all_calls: 1
 <1><ed1>: Abbrev Number: 5 (DW_TAG_subprogram)
    <ed2>   DW_AT_external    : 1
    <ed2>   DW_AT_name        : (indirect string, offset: 0x80213): HAL_GetUIDw1
    <ed6>   DW_AT_decl_file   : 1
    <ed6>   DW_AT_decl_line   : 448
    <ed8>   DW_AT_decl_column : 10
    <ed9>   DW_AT_prototyped  : 1
    <ed9>   DW_AT_type        : <0xb70>
    <edd>   DW_AT_low_pc      : 0
    <ee1>   DW_AT_high_pc     : 0x14
    <ee5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ee7>   DW_AT_call_all_calls: 1
 <1><ee7>: Abbrev Number: 5 (DW_TAG_subprogram)
    <ee8>   DW_AT_external    : 1
    <ee8>   DW_AT_name        : (indirect string, offset: 0x80206): HAL_GetUIDw0
    <eec>   DW_AT_decl_file   : 1
    <eec>   DW_AT_decl_line   : 439
    <eee>   DW_AT_decl_column : 10
    <eef>   DW_AT_prototyped  : 1
    <eef>   DW_AT_type        : <0xb70>
    <ef3>   DW_AT_low_pc      : 0
    <ef7>   DW_AT_high_pc     : 0x14
    <efb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <efd>   DW_AT_call_all_calls: 1
 <1><efd>: Abbrev Number: 5 (DW_TAG_subprogram)
    <efe>   DW_AT_external    : 1
    <efe>   DW_AT_name        : (indirect string, offset: 0x802f2): HAL_GetDEVID
    <f02>   DW_AT_decl_file   : 1
    <f02>   DW_AT_decl_line   : 430
    <f04>   DW_AT_decl_column : 10
    <f05>   DW_AT_prototyped  : 1
    <f05>   DW_AT_type        : <0xb70>
    <f09>   DW_AT_low_pc      : 0
    <f0d>   DW_AT_high_pc     : 0x18
    <f11>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f13>   DW_AT_call_all_calls: 1
 <1><f13>: Abbrev Number: 5 (DW_TAG_subprogram)
    <f14>   DW_AT_external    : 1
    <f14>   DW_AT_name        : (indirect string, offset: 0x800cf): HAL_GetREVID
    <f18>   DW_AT_decl_file   : 1
    <f18>   DW_AT_decl_line   : 421
    <f1a>   DW_AT_decl_column : 10
    <f1b>   DW_AT_prototyped  : 1
    <f1b>   DW_AT_type        : <0xb70>
    <f1f>   DW_AT_low_pc      : 0
    <f23>   DW_AT_high_pc     : 0x14
    <f27>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f29>   DW_AT_call_all_calls: 1
 <1><f29>: Abbrev Number: 5 (DW_TAG_subprogram)
    <f2a>   DW_AT_external    : 1
    <f2a>   DW_AT_name        : (indirect string, offset: 0x80357): HAL_GetHalVersion
    <f2e>   DW_AT_decl_file   : 1
    <f2e>   DW_AT_decl_line   : 412
    <f30>   DW_AT_decl_column : 10
    <f31>   DW_AT_prototyped  : 1
    <f31>   DW_AT_type        : <0xb70>
    <f35>   DW_AT_low_pc      : 0
    <f39>   DW_AT_high_pc     : 0x10
    <f3d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f3f>   DW_AT_call_all_calls: 1
 <1><f3f>: Abbrev Number: 6 (DW_TAG_subprogram)
    <f40>   DW_AT_external    : 1
    <f40>   DW_AT_name        : (indirect string, offset: 0x800e3): HAL_ResumeTick
    <f44>   DW_AT_decl_file   : 1
    <f44>   DW_AT_decl_line   : 402
    <f46>   DW_AT_decl_column : 13
    <f47>   DW_AT_prototyped  : 1
    <f47>   DW_AT_low_pc      : 0
    <f4b>   DW_AT_high_pc     : 0x1c
    <f4f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f51>   DW_AT_call_all_calls: 1
 <1><f51>: Abbrev Number: 6 (DW_TAG_subprogram)
    <f52>   DW_AT_external    : 1
    <f52>   DW_AT_name        : (indirect string, offset: 0x8022d): HAL_SuspendTick
    <f56>   DW_AT_decl_file   : 1
    <f56>   DW_AT_decl_line   : 385
    <f58>   DW_AT_decl_column : 13
    <f59>   DW_AT_prototyped  : 1
    <f59>   DW_AT_low_pc      : 0
    <f5d>   DW_AT_high_pc     : 0x1c
    <f61>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f63>   DW_AT_call_all_calls: 1
 <1><f63>: Abbrev Number: 29 (DW_TAG_subprogram)
    <f64>   DW_AT_external    : 1
    <f64>   DW_AT_name        : (indirect string, offset: 0x33233): HAL_Delay
    <f68>   DW_AT_decl_file   : 1
    <f69>   DW_AT_decl_line   : 359
    <f6b>   DW_AT_decl_column : 13
    <f6c>   DW_AT_prototyped  : 1
    <f6c>   DW_AT_low_pc      : 0x8000530
    <f70>   DW_AT_high_pc     : 0x48
    <f74>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f76>   DW_AT_call_all_tail_calls: 1
    <f76>   DW_AT_sibling     : <0xfa8>
 <2><f7a>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <f7b>   DW_AT_name        : (indirect string, offset: 0x33237): Delay
    <f7f>   DW_AT_decl_file   : 1
    <f7f>   DW_AT_decl_line   : 359
    <f81>   DW_AT_decl_column : 32
    <f82>   DW_AT_type        : <0xb70>
    <f86>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><f89>: Abbrev Number: 10 (DW_TAG_variable)
    <f8a>   DW_AT_name        : (indirect string, offset: 0x800b7): tickstart
    <f8e>   DW_AT_decl_file   : 1
    <f8e>   DW_AT_decl_line   : 361
    <f90>   DW_AT_decl_column : 12
    <f91>   DW_AT_type        : <0xb70>
    <f95>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><f98>: Abbrev Number: 10 (DW_TAG_variable)
    <f99>   DW_AT_name        : (indirect string, offset: 0x804d9): wait
    <f9d>   DW_AT_decl_file   : 1
    <f9d>   DW_AT_decl_line   : 362
    <f9f>   DW_AT_decl_column : 12
    <fa0>   DW_AT_type        : <0xb70>
    <fa4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><fa7>: Abbrev Number: 0
 <1><fa8>: Abbrev Number: 5 (DW_TAG_subprogram)
    <fa9>   DW_AT_external    : 1
    <fa9>   DW_AT_name        : (indirect string, offset: 0x801e1): HAL_GetTickFreq
    <fad>   DW_AT_decl_file   : 1
    <fad>   DW_AT_decl_line   : 343
    <faf>   DW_AT_decl_column : 21
    <fb0>   DW_AT_prototyped  : 1
    <fb0>   DW_AT_type        : <0xdea>
    <fb4>   DW_AT_low_pc      : 0
    <fb8>   DW_AT_high_pc     : 0x14
    <fbc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fbe>   DW_AT_call_all_calls: 1
 <1><fbe>: Abbrev Number: 30 (DW_TAG_subprogram)
    <fbf>   DW_AT_external    : 1
    <fbf>   DW_AT_name        : (indirect string, offset: 0x804a9): HAL_SetTickFreq
    <fc3>   DW_AT_decl_file   : 1
    <fc4>   DW_AT_decl_line   : 310
    <fc6>   DW_AT_decl_column : 19
    <fc7>   DW_AT_prototyped  : 1
    <fc7>   DW_AT_type        : <0xdb9>
    <fcb>   DW_AT_low_pc      : 0
    <fcf>   DW_AT_high_pc     : 0x6c
    <fd3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fd5>   DW_AT_call_all_tail_calls: 1
    <fd5>   DW_AT_sibling     : <0x1007>
 <2><fd9>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <fda>   DW_AT_name        : (indirect string, offset: 0x8090a): Freq
    <fde>   DW_AT_decl_file   : 1
    <fde>   DW_AT_decl_line   : 310
    <fe0>   DW_AT_decl_column : 55
    <fe1>   DW_AT_type        : <0xdea>
    <fe5>   DW_AT_location    : 2 byte block: 91 5f 	(DW_OP_fbreg: -33)
 <2><fe8>: Abbrev Number: 10 (DW_TAG_variable)
    <fe9>   DW_AT_name        : (indirect string, offset: 0x80799): status
    <fed>   DW_AT_decl_file   : 1
    <fed>   DW_AT_decl_line   : 312
    <fef>   DW_AT_decl_column : 21
    <ff0>   DW_AT_type        : <0xdb9>
    <ff4>   DW_AT_location    : 2 byte block: 91 67 	(DW_OP_fbreg: -25)
 <2><ff7>: Abbrev Number: 10 (DW_TAG_variable)
    <ff8>   DW_AT_name        : (indirect string, offset: 0x80374): prevTickFreq
    <ffc>   DW_AT_decl_file   : 1
    <ffc>   DW_AT_decl_line   : 313
    <ffe>   DW_AT_decl_column : 23
    <fff>   DW_AT_type        : <0xdea>
    <1003>   DW_AT_location    : 2 byte block: 91 66 	(DW_OP_fbreg: -26)
 <2><1006>: Abbrev Number: 0
 <1><1007>: Abbrev Number: 5 (DW_TAG_subprogram)
    <1008>   DW_AT_external    : 1
